{
  "lecture_info": {
    "id": 3,
    "course_code": "MAPP_F_MKT404_EN_2025",
    "lecture_title": "Session 3 - Framework for customer experience.pdf",
    "analysis_status": "completed"
  },
  "consolidation_stats": {
    "original_slides": 41,
    "educational_slides": 34,
    "filtered_slides": 7,
    "topics_created": 6,
    "semantic_chunks": 4,
    "summary": "Consolidated into 6 topics: the customer journey, mckinsey purchasing funnel, the construction of personas, never stop daring, gen ai is reshaping customer journeys (+1 more). Contains 9 definitions, 58 examples, and 155 key concepts."
  },
  "topics": [
    {
      "name": "the customer journey",
      "slides": [
        1,
        1,
        1,
        2,
        2,
        2,
        2,
        3,
        3,
        3,
        3,
        4,
        4,
        4,
        4,
        5,
        5,
        5,
        5
      ],
      "main_text": "• Pre purchase, purchase and post purchase stages\n\nPurchase Stage:\nThis stage encompasses all customer interactions with the brand during the purchase. It includes behaviors such as choice, ordering, and payment. It is considered as the most “temporally compressed” of the three stages.\n\nThe Customer Journey\n\n- Types of Touch Points\n\nPartner-owned touch points:\n\nThese touch points are jointly designed, controlled and managed by the firm and its partner(s). The partners could be multivendor partners, multichannel distributors partners, communication partners, etc.\n\nThe Customer Journey\n\n- Types of Touch Points\n\nSocial/external touch points:\n\nThese touch points are all external people that may influence the customer experience. It may concerns the advices of customers (e.g. Comments on TripAdvisor) or peer influences, independent information sources, etc. Sometimes influencers may be independent and sometimes they are in line with firm expectations. Lemon & Verhoef (2016)\n\nIt includes the use/consumption of the product/service, and service requests. It is an important phase where the customer will evaluate his shopping experience. Based on this evaluation, he will engage or not with the brand, become loyal or not, use negative or positive W.O.M’s.\n\n• Today's exercise\n\nCustomer activities\n(what is the customer doing?)\n\nExperience (what is the customer's feeling : positive, negative, neutral; High versus Low)\n\nTouchpoints\n\n• Types of Touch Points\n\nBrand-owned touch points:\nThese touch points customer interactions are designed, controlled and managed by the firm. It may concern the marketing mix (products, price strategy, service, distribution) and more broadly the brand owned media such as advertising, websites, loyalty programs, etc.\n\nThe Customer Journey Map\n\n- What are the steps in a customer journey? Customer activities\n(what is the customer doing?)\n\nExperience (what is the customer's feeling : positive, negative, neutral; High versus Low)\n\nTouchpoints\n\n• Example Nike\n\nhttps://www.questionpro.com/blog/nike-customer-experience/\n\nThe Customer Journey\n\nOverview of the Customer Journey\n\nFeedback\n\nPREVIOUS EXPERIENCE (t-n)\nPrepurchase Stage\nPurchase Stage\nPostpurchase Stage\n\nCURRENT EXPERIENCE (t)\nPre purchase Stage\nTouchpoints: Brand owned, partner owned, customer owned, social/external\nBehaviors: need recognition, consideration, search\n\nPurchase Stage\nTouchpoints: Brand owned, partner owned, customer owned, social/external\nBehaviors: choice, ordering, payment\n\nPost purchase Stage\nTouchpoints: Brand owned, partner owned, customer owned, social/external\nBehaviors: consumption, usage, engagement, service requests\n\nFUTURE EXPERIENCE (t+n)\nPrepurchase Stage\nPurchase Stage\nPostpurchase Stage\n\nCustomer Journey\n\nExtracted from Lemon & Verhoef (2016, p. 77)\n\nThe Customer Journey\n\n- Types of Touch Points\n\nCustomer-owned touch points:\n\nThese touch points concerned all customer actions that are part of the customer experience. The company, its partners or others do not influence or control these actions. These actions may include customers reflecting on their needs and desires and the transformation of a company product into a use not intended by the firm.\n\nThe Customer Journey Map\n\n- Example\n\nhttps://miro.com/miroverse/fly-ux-customer-journey-map/\n\nFly UX - Customer Journey Map\n\nFly UX Customer Journey Map by Eva Huse Pedersen\nMiro.com\n\nThe Customer Journey\n\nPre purchase, purchase and post purchase stages\n\nPre purchase Stage:\nThis stage encompasses all direct or indirect customer interactions with the brand before the purchase. It generally starts with the “need/goal/impulse recognition to consideration of satisfying that need/goal/impulse with a purchase” including the search stage (Lemon & Verhoef, 2016, p.76).\n\nNike Customer Journey\n\n• Today's exercise\n\n• Groups of 2\n\n• Create a persona corresponding to a segment of the Nike brand. • Map the customer journey of this persona to buy Nike sneakers online\n\n• Be ready to present in front of everyone 🙂",
      "key_concepts": [
        "Customer Journey",
        "Purchase Stage",
        "Pre purchase",
        "Post purchase",
        "Touchpoints",
        "Behaviors",
        "Temporally compressed",
        "Touch Points",
        "Partner-owned touch points",
        "Social/external touch points",
        "Customer Experience",
        "Peer Influence",
        "Influencers",
        "Post purchase Stage",
        "Customer Evaluation",
        "Brand Loyalty",
        "Word-of-Mouth (W.O.M.)",
        "Consumption",
        "Service Requests",
        "E-commerce",
        "Multichannel distributor",
        "Influencer Marketing",
        "Social Media",
        "Product Reviews",
        "Customer Journey Mapping",
        "Prepurchase",
        "Purchase",
        "Postpurchase",
        "Customer Activities",
        "Brand-owned touch points",
        "Marketing Mix",
        "Brand owned media",
        "Sponsorship",
        "Communication partner",
        "Customer Journey Map",
        "Customer Journey Stages",
        "Awareness",
        "Consideration",
        "Decision",
        "Service",
        "Loyalty",
        "Touchpoint",
        "Customer Actions",
        "Experience",
        "Pain Points",
        "Potential Solution",
        "Customer Journey Overview",
        "Previous Experience",
        "Current Experience",
        "Future Experience",
        "Pre-purchase Stage",
        "Post-purchase Stage",
        "Customer Behaviors",
        "Feedback Loop",
        "Brand Touchpoints",
        "Pre-purchase",
        "Post-purchase",
        "Customer-owned touch points",
        "Unintended product use",
        "User Experience (UX)",
        "Customer Goals",
        "Customer Behaviours",
        "Journey Stages",
        "Customer Interactions",
        "Need Recognition",
        "Search Stage",
        "Website",
        "Advertising",
        "Product Customization",
        "User-generated content",
        "Product modification",
        "IKEA Hacking",
        "Persona Application",
        "Brand Segmentation",
        "Group Exercise",
        "Presentation"
      ],
      "definitions": [
        {
          "term": "Purchase Stage",
          "definition": "This stage encompasses all customer interactions with the brand during the purchase. It includes behaviors such as choice, ordering, and payment. It is considered as the most “temporally compressed” of the three stages."
        },
        {
          "term": "Partner-owned touch points",
          "definition": "These touch points are jointly designed, controlled and managed by the firm and its partner(s). The partners could be multivendor partners, multichannel distributors partners, communication partners, etc."
        },
        {
          "term": "Social/external touch points",
          "definition": "These touch points are all external people that may influence the customer experience. It may concerns the advices of customers (e.g. Comments on TripAdvisor) or peer influences, independent information sources, etc. Sometimes influencers may be independent and sometimes they are in line with firm expectations."
        },
        {
          "term": "Post purchase Stage",
          "definition": "The last stage concerns all interactions with the brand and its environment after purchase. It includes the use/consumption of the product/service, and service requests. It is an important phase where the customer will evaluate his shopping experience. Based on this evaluation, he will engage or not with the brand, become loyal or not, use negative or positive W.O.M’s."
        },
        {
          "term": "Brand-owned touch points",
          "definition": "These touch points customer interactions are designed, controlled and managed by the firm. It may concern the marketing mix (products, price strategy, service, distribution) and more broadly the brand owned media such as advertising, websites, loyalty programs, etc."
        },
        {
          "term": "Customer-owned touch points",
          "definition": "These touch points concerned all customer actions that are part of the customer experience. The company, its partners or others do not influence or control these actions. These actions may include customers reflecting on their needs and desires and the transformation of a company product into a use not intended by the firm."
        },
        {
          "term": "Pre purchase Stage",
          "definition": "This stage encompasses all direct or indirect customer interactions with the brand before the purchase. It generally starts with the “need/goal/impulse recognition to consideration of satisfying that need/goal/impulse with a purchase” including the search stage (Lemon & Verhoef, 2016, p.76)."
        }
      ],
      "examples": [
        "multivendor partners",
        "multichannel distributors partners",
        "communication partners",
        "Comments on TripAdvisor",
        "The 'wethenew' website selling Air Jordan sneakers is an example of a partner-owned touch point, specifically a multichannel distributor.",
        "A screenshot of a YouTube video titled 'Air Jordan 1 Mid Chicago Black Toe REVIEW and ON-FEET!', showing a product review which is a form of external touchpoint.",
        "A screenshot of an Instagram post from the influencer 'xsqueezie' announcing a collaboration with Nike. The caption (in French) discusses a new fitness program in partnership with Nike, illustrating an influencer acting as an external touchpoint in line with firm expectations.",
        "Gillette",
        "Mitsubishi",
        "Coca-Cola",
        "IBM",
        "Walt Disney",
        "MasterCard",
        "Nescafé",
        "Visa",
        "BIC",
        "Philips",
        "Ford",
        "FedEx",
        "Esso",
        "Vodafone",
        "Pampers",
        "IKEA",
        "Intel",
        "Microsoft",
        "Bosch",
        "Durex",
        "Heineken",
        "Adobe",
        "Red Bull",
        "Samsung",
        "A sponsored sports team (like the French national football team) is an example of a partner-owned touch point, representing a communication partnership.",
        "The entire slide is a detailed example of a Customer Journey Map for the brand Nike.",
        "Customers reflecting on their needs and desires.",
        "The transformation of a company product into a use not intended by the firm.",
        "The entire 'Fly UX - Customer Journey Map' is an example. Specific pain points mentioned include communication issues, confusing options, language barriers on the website, and lack of clarity on fare inclusions.",
        "Nike's e-commerce website",
        "Nike's print/digital advertising",
        "Nike's product customization service ('Nike By You')",
        "The 'IKEA hackers' website, where customers share modifications to IKEA products, is an example of a customer-owned touch point.",
        "The exercise itself is an example: creating a persona for a Nike brand segment and mapping their journey to buy sneakers online."
      ],
      "diagrams": [
        {
          "type": "flowchart",
          "key_points": [
            "Prepurchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: need recognition, consideration, search.",
            "Purchase Stage (Yellow Highlighted Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: choice, ordering, payment.",
            "Postpurchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: consumption, usage, engagement, service requests."
          ],
          "description": "A flowchart diagram illustrates the three stages of the customer journey as three sequential, overlapping chevrons pointing from left to right. The first stage is 'Prepurchase Stage' in blue. The middle stage, 'Purchase Stage', is highlighted in yellow. The final stage is 'Postpurchase Stage' in blue. Each chevron contains information about its respective touchpoints and behaviors."
        },
        {
          "type": "flowchart",
          "key_points": [
            "Prepurchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: need recognition, consideration, search.",
            "Purchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: choice, ordering, payment.",
            "Postpurchase Stage (Yellow Highlighted Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: consumption, usage, engagement, service requests."
          ],
          "description": "A flowchart diagram illustrates the three stages of the customer journey as three sequential, overlapping chevrons pointing from left to right. The first stage is 'Prepurchase Stage' in blue. The middle stage is 'Purchase Stage' in blue. The final stage, 'Postpurchase Stage', is highlighted in yellow. Each chevron contains information about its respective touchpoints and behaviors."
        },
        {
          "type": "screenshot",
          "key_points": [
            "Product: Air Jordan 1 Mid Chicago Black Toe",
            "Retailer: wethenew",
            "Price: €280.00",
            "Features: Installment payments, loyalty program, express delivery."
          ],
          "description": "A screenshot of a product page from the e-commerce website 'wethenew'. The page displays the 'Air Jordan 1 Mid Chicago Black Toe' sneaker. Key elements shown are the product image, product name, price (€280.00), installment payment options (2x, 3x, 4x), loyalty points (+280 points de fidélité), size selection (TAILLE), a guide to sizes (GUIDE DES TAILLES), an 'Add to cart' button (Ajouter au panier), and delivery information (48H Livraison). The top navigation includes a search bar, user account, wishlist, and cart icons."
        },
        {
          "type": "flowchart and table",
          "key_points": [
            "The customer journey is divided into three main phases: Prepurchase, Purchase, and Postpurchase.",
            "The journey is further broken down into 6 specific steps.",
            "The map tracks three key aspects at each step: Customer activities, Experience/Feelings, and Touchpoints."
          ],
          "description": "The slide presents a template for a customer journey map. At the top, a flowchart shows three main phases: 'Prepurchase', 'Purchase', and 'Postpurchase', connected by arrows. Below this, a red bar is divided into six sequential steps: 'Step 1' through 'Step 6'. The main body is a table with three rows labeled: 'Customer activities (what is the customer doing?)', 'Experience (what is the customer's feeling : positive, negative, neutral; High versus Low)', and 'Touchpoints'. The table columns correspond to the six steps and are currently empty, intended for an exercise."
        },
        {
          "type": "image collage",
          "key_points": [],
          "description": "A collage of numerous well-known brand logos, serving as examples of brands that manage their own touch points."
        },
        {
          "type": "framework/table",
          "key_points": [
            "The customer journey is divided into Prepurchase, Purchase, and Postpurchase stages.",
            "Each stage consists of multiple steps.",
            "For each step, the map analyzes customer activities, their emotional experience, and the touchpoints they interact with."
          ],
          "description": "A template for a customer journey map. It has a timeline at the top divided into three main stages: Prepurchase, Purchase, and Postpurchase. Below this, the timeline is marked with six steps (Step 1 to Step 6). Step 1, 2, 3 are under Prepurchase; Step 4 is under Purchase; Step 5, 6 are under Postpurchase. The rows below are categories for analysis at each step: 'Customer activities (what is the customer doing?)', 'Experience (what is the customer's feeling : positive, negative, neutral; High versus Low)', and 'Touchpoints'."
        },
        {
          "type": "table/matrix",
          "key_points": [
            "Awareness Stage: Touchpoint is Nike.com; customer feels interested but hesitant due to difficulty finding items.",
            "Consideration Stage: Touchpoint is Product Pages; customer is curious but faces uncertainty about product features.",
            "Decision Stage: Touchpoint is Online Shopping; customer is excited but faces a lengthy checkout process.",
            "Service Stage: Touchpoint is Returns and Exchanges; customer is frustrated due to complicated return processes.",
            "Loyalty Stage: Touchpoint is Exclusive Drops; customer is satisfied and happy but has limited opportunities for early access."
          ],
          "description": "A detailed customer journey map for the brand Nike, structured as a grid. The columns represent the five stages of the journey: Awareness, Consideration, Decision, Service, and Loyalty. The rows represent different aspects of the customer experience: TOUCHPOINT, Customer Actions, Experience, Pain Points, and Potential Solution. The 'Experience' row includes a line graph with emoticons (sad, neutral, happy, frustrated, very happy) plotting the emotional journey of the customer through the stages. Each cell in the grid contains specific information for Nike. For example, in the 'Awareness' stage, the touchpoint is 'Nike.com', the customer action is visiting the website, the pain point is 'Difficulty in finding desired items', and the potential solution is to 'Enhance website navigation and search functionality'."
        },
        {
          "type": "flowchart",
          "key_points": [
            "The customer journey is a process over time, influenced by past experiences and shaping future ones.",
            "The current experience is comprised of pre-purchase, purchase, and post-purchase stages.",
            "Each stage involves various touchpoints (brand, partner, customer, and social/external owned).",
            "Each stage is characterized by specific customer behaviors.",
            "There is a feedback mechanism where the current experience informs future 'previous experiences'."
          ],
          "description": "A flowchart illustrating the Customer Journey over time. It is divided into three main columns: 'PREVIOUS EXPERIENCE (t-n)', 'CURRENT EXPERIENCE (t)', and 'FUTURE EXPERIENCE (t+n)'. A large yellow arrow labeled 'Customer Journey' flows from left to right underneath these columns. The 'CURRENT EXPERIENCE' column is further subdivided into three sequential stages: 'Pre purchase Stage' (green), 'Purchase Stage' (yellow), and 'Post purchase Stage' (orange). Each of these stages lists associated 'Touchpoints' and 'Behaviors'. Specifically:\n- Pre purchase Stage: Touchpoints include Brand owned, partner owned, customer owned, social/external. Behaviors include need recognition, consideration, search.\n- Purchase Stage: Touchpoints include Brand owned, partner owned, customer owned, social/external. Behaviors include choice, ordering, payment.\n- Post purchase Stage: Touchpoints include Brand owned, partner owned, customer owned, social/external. Behaviors include consumption, usage, engagement, service requests.\nA 'Feedback' loop is shown with arrows pointing from the Current Experience stages back to influence the Previous Experience."
        },
        {
          "type": "concept map",
          "key_points": [
            "PRE-PURCHASE Touchpoints: SOCIAL MEDIA, ADS, MARKETING, DISPLAYS, PROMOS, EMAIL, DIRECT MAIL, PR, WORD OF MOUTH.",
            "PURCHASE Touchpoints: SALES PERSON, UP SALE, PACKAGING, ECOMMERCE, WEB, STORE OR OFFICE, CATALOGUE.",
            "POST-PURCHASE Touchpoints: INVOICE, EVENTS, SURVEYS, CUSTOMER SERVICE, BILLING, FORUMS, SOCIAL MEDIA, NEWS LETTER, LOYALTY PROGRAM, BRAND PROMISE."
          ],
          "description": "A diagram titled 'BRAND TOUCHPOINTS' which maps various touchpoints to the three customer journey stages. The stages (PRE-PURCHASE, PURCHASE, POST-PURCHASE) are listed at the bottom. An overarching orange arrow labeled 'CUSTOMER EXPERIENCE' spans the top. Touchpoints are represented as colored circles (blue and orange) and are grouped under their relevant stage."
        },
        {
          "type": "table/chart",
          "key_points": [
            "The map provides a step-by-step analysis of a customer's interaction with a service.",
            "It tracks customer goals, behaviors, and pain points at each stage.",
            "Identifying pain points is crucial for improving the overall customer experience."
          ],
          "description": "An example of a detailed Customer Journey Map for a fictional airline, 'Fly UX'. The map is a grid with columns representing stages of the journey and rows representing different aspects of the customer experience. \n- Stages (Columns): Awareness, Consideration, Booking Page - Search flight, Flight Search Result, Select Fare. \n- Aspects (Rows): Goals, Behaviours, Connect, Pain Points. \nEach cell contains bullet points detailing the customer's experience at that stage. For example, under 'Consideration', a 'Pain Point' is 'The options are changing very quickly and that makes it confusing'. Under 'Select Fare', a 'Goal' is 'I want to understand what value I get for the price' and a 'Pain Point' is 'I am not sure what is included in the fare'."
        },
        {
          "type": "diagram",
          "key_points": [
            "The Pre-purchase stage is the first phase of the customer journey.",
            "It involves specific touchpoints and behaviors like need recognition and search."
          ],
          "description": "A simplified visual representation of the customer journey stages, shown as three connected chevrons pointing from left to right. The first chevron is green and labeled 'Prepurchase Stage', listing 'Touchpoints: Brand owned, partner owned, customer owned, social/external' and 'Behaviors: need recognition, consideration, search'. The subsequent chevrons for 'Purchase Stage' and 'Postpurchase Stage' are shaded in blue and contain similar labels for touchpoints and behaviors, though the text is less prominent. The Pre-purchase stage is visually highlighted."
        },
        {
          "type": "image examples",
          "key_points": [
            "Example 1: Nike website with a '30% OFF EVERYTHING' promotion.",
            "Example 2: Nike 'Just do it.' advertisement with the tagline 'It's only a crazy dream until you do it.'",
            "Example 3: Nike 'By You' product customization tool, labeled in French 'Chaussures Personnalisées Nike By You'."
          ],
          "description": "The slide displays three visual examples of Nike's brand-owned touch points. 1) Top-left: A screenshot of the Nike e-commerce website, showing a promotional banner for '30% OFF EVERYTHING'. 2) Bottom-left: A Nike advertisement with a young girl running, featuring the slogan 'It's only a crazy dream until you do it. Just do it.'. 3) Right: A screenshot of the Nike 'By You' product customization page, showing a personalized shoe and the text 'Chaussures Personnalisées Nike By You'."
        },
        {
          "type": "screenshot",
          "key_points": [
            "Website: IKEA hackers",
            "Concept: Modifying and customizing IKEA products.",
            "Functionality: Showcasing ideas, categories, and allowing users to submit hacks.",
            "Example of: Transformation of a product for unintended uses, a customer-owned touch point."
          ],
          "description": "A screenshot of the 'IKEA hackers' website homepage. The logo is a stylized version of the IKEA logo. The main navigation includes HACKS, IDEAS, BEST OF, START HERE, SUBMIT HACK, and SHOP. The main heading is 'HACKS'. The text describes how to transform, upcycle, and customize IKEA furniture. It mentions specific examples like adding legs to a KALLAX shelf or creating LEGO storage. Below this is a section titled 'Popular Ikea Hacking Categories' with image links to 'Living Room', 'Dining', 'Dividers', and 'Desks'."
        },
        {
          "type": "icon",
          "key_points": [],
          "description": "An icon in the bottom right corner shows a message/chat interface with a large red circle containing a white clock symbol overlaid on top of it, suggesting a timed activity or presentation."
        }
      ],
      "formulas": [],
      "notes": "Reference: Lemon & Verhoef (2016). Slide number in the bottom right corner is 6. Logos at the bottom include Audencia, EQUIS, AACSB, AMBA, CEFDG, CONFERENCE DES GRANDES ECOLES, and Coalition. Slide number 11. Source citation: Lemon & Verhoef (2016). Slide number 16. Cites 'Lemon & Verhoef (2016)' as a source. Reference: (2016). Slide number in the bottom right corner is 7. Slide number 12. This slide provides a visual example of a partner-owned touch point discussed in the previous slide. Slide number 17. This slide provides visual examples for the concept of social/external touch points discussed in the previous slide. This slide provides the framework or template for the 'Today's exercise' on mapping a customer journey. The slide number is 37. Reference: Lemon & Verhoef (2016). Slide number in the bottom right corner is 8. Slide number 13. This slide provides another visual example of a partner-owned touch point. Slide number 18. This slide presents a generic framework for creating a customer journey map. The slide provides a complete, practical example of a customer journey map, illustrating how to fill out the template from the previous slide. A source URL is provided. The slide number is 38. The model is attributed to Lemon & Verhoef (2016, p. 77). Slide number in the bottom right corner is 9. Slide number 14. Source citation: Lemon & Verhoef (2016). Slide number 19. The source of the example is Miroverse, created by Eva Huse Pedersen. The definition provided is sourced from Lemon & Verhoef (2016). Slide number in the bottom right corner is 10. Slide number 15. This slide provides a visual example of a customer-owned touch point, as defined in the previous slide. This slide outlines a practical, in-class group exercise. It requires students to apply the concepts of persona creation and customer journey mapping to a real-world brand, Nike. The final step is a presentation.",
      "educational_value": 1.0
    },
    {
      "name": "mckinsey purchasing funnel",
      "slides": [
        1,
        2,
        3,
        4
      ],
      "main_text": "McKinsey purchasing funnel\n• 5 steps purchasing funnel",
      "key_concepts": [
        "McKinsey purchasing funnel",
        "Awareness",
        "Familiarity",
        "Consideration",
        "Purchase",
        "Loyalty",
        "Online vs Offline channels",
        "Solution Evaluation",
        "Evaluation of the Purchasing Experience",
        "Shopping Value",
        "Value in use",
        "Customer journey mapping",
        "Brand consideration set",
        "Brand choice",
        "Camera market"
      ],
      "definitions": [],
      "examples": [
        "A customer journey for purchasing a camera, starting with awareness of brands like Nikon, Sony, Canon, etc., and ending with the purchase of a Canon 5D MK4.",
        "A customer journey for purchasing a camera, showing brands like Nikon, Sony, Canon, etc., and culminating in the purchase of a Canon product."
      ],
      "diagrams": [
        {
          "type": "flowchart",
          "key_points": [
            "The funnel illustrates a progressive reduction of options.",
            "The process starts with broad awareness of many options.",
            "It narrows down to familiarity with a smaller set.",
            "Further narrowing occurs during the consideration phase.",
            "A purchase decision is made from a very small set of options.",
            "The final stage is achieving customer loyalty."
          ],
          "description": "A five-stage flowchart representing the McKinsey purchasing funnel. The stages are labeled from left to right: AWARENESS, FAMILIARITY, CONSIDERATION, PURCHASE, LOYALTY. Each stage is depicted with a group of circles, which decrease in number at each subsequent stage, symbolizing the narrowing of choices. \nStage 1 (AWARENESS): A grid of 24 circles (12 orange, 12 white outline).\nStage 2 (FAMILIARITY): A grid of 12 circles (6 orange, 6 white outline).\nStage 3 (CONSIDERATION): A grid of 6 circles (3 orange, 3 white outline).\nStage 4 (PURCHASE): A row of 3 circles (2 orange, 1 white outline).\nStage 5 (LOYALTY): Represented by a single sun-like icon, symbolizing the final choice and brand loyalty."
        },
        {
          "type": "diagram",
          "key_points": [
            "The funnel maps specific online and offline marketing tactics to each stage of the customer journey.",
            "The customer journey involves both 'Solution Evaluation' and 'Evaluation of the Purchasing Experience'.",
            "The goal is to provide 'Shopping Value' and achieve 'Value in use' for the customer.",
            "Different channels are effective at different stages of the funnel."
          ],
          "description": "A detailed diagram of the 5-step purchasing funnel, showing specific marketing channels and customer activities within each stage. The funnel is divided horizontally into 'ONLINE' and 'OFFLINE' sections. The entire process is bracketed by 'Solution Evaluation' at the top and 'Evaluation of the Purchasing Experience' and 'Shopping Value' at the bottom. The funnel begins with a shopping cart icon and ends with an icon of a person holding a shopping bag, labeled 'Value in use'.\n\n- **AWARENESS:**\n  - ONLINE: SEO, e-targeting, Social media, Banners, Mobile Marketing, SEA, Blog, Website, Youtube\n  - OFFLINE: Cinema, Radio, Press, Billboard, Mailing, Catalog, TV, POS, Sponsoring, Display\n\n- **FAMILIARITY:**\n  - ONLINE: SEO, Consumer opinion, Social media, Rankings, Mobile Marketing, Newsletter, Website, Blog, Youtube\n  - OFFLINE: Recommendations, Press, Radio, Billboard, Word of Mouth, Catalog, Cinema, POS, Display\n\n- **CONSIDERATION:**\n  - ONLINE: e-Mailing, Consumer opinion, Website, Newsletter, Blog, Youtube\n  - OFFLINE: Recommendations, Press, TV, Offers, Location, Coupons, Word of Mouth, Catalog, Cinema\n\n- **PURCHASE:**\n  - ONLINE: POS, e-mail Conversation, Checkout\n  - OFFLINE: Cash register ticket, Chat, Receipt\n\n- **LOYALTY:**\n  - ONLINE: Newsletter, Social media\n  - OFFLINE: Loyalty card, Mailing"
        },
        {
          "type": "diagram",
          "key_points": [
            "Illustrates how a broad set of camera brands (Nikon, Olympus, Pentax, Sony, Canon, Panasonic) is narrowed down.",
            "The consumer moves from awareness of 6 brands to considering 3 brands (Sony, Canon, Nikon).",
            "The final purchase is a Canon camera.",
            "Loyalty is demonstrated by identifying with a specific high-end model, the Canon 5D MK4."
          ],
          "description": "An example application of the McKinsey purchasing funnel for buying a camera. The diagram structure is the same as the previous slide, with ONLINE/OFFLINE channels and the five stages. It shows the narrowing of camera brands considered by a consumer throughout the journey. It starts with an icon of a person with a camera pushing a shopping cart, which contains a camera icon. It ends with an icon of a person holding a camera and a shopping bag, with the final product 'CANON 5D MK4' specified.\n\n- **AWARENESS:**\n  - ONLINE: Google, Facebook, 500px, ADS, Youtube, Blog, Website\n  - OFFLINE: Cinema, Billboard, Press, FNAC, Friends\n  - Brands considered: NIKON, OLYMPUS, PENTAX, SONY, CANON, PANASONIC\n\n- **FAMILIARITY:**\n  - ONLINE: SEO, Consumer opinion, Social media, Rankings, Mobile Marketing, Newsletter, Website, Blog, Youtube\n  - OFFLINE: Recommendations, Press, Radio, Billboard, Mailing, Catalog, Cinema, POS, Display\n  - Brands considered: PENTAX, SONY, CANON, NIKON, OLYMPUS\n\n- **CONSIDERATION:**\n  - ONLINE: e-Mailing, Consumer opinion, Website, Newsletter, Blog, Youtube\n  - OFFLINE: Recommendations, Press, TV, Offers, Location, Coupons, Word of Mouth, Catalog, Cinema\n  - Brands considered: SONY, CANON, NIKON\n\n- **PURCHASE:**\n  - ONLINE: POS, e-mail Confirmation, Checkout\n  - OFFLINE: Cash register ticket, Receipt\n  - Brand purchased: CANON\n\n- **LOYALTY:**\n  - ONLINE: Newsletter, Social media\n  - OFFLINE: Loyalty card, Mailing\n  - Loyal product: CANON 5D MK4"
        },
        {
          "type": "diagram",
          "key_points": [
            "Illustrates the narrowing of a brand consideration set for cameras, from 6 initial brands down to 1 purchased brand.",
            "The consumer journey progresses through awareness, familiarity, and consideration stages.",
            "The final purchase decision is for the 'CANON' brand.",
            "Unlike the previous slide, this version is more generic, lacking the specific icons and final product model (5D MK4)."
          ],
          "description": "An example application of the McKinsey purchasing funnel for buying a camera, nearly identical to the previous slide but without the illustrative icons and the specific final product model. The diagram structure shows ONLINE/OFFLINE channels and the five stages, illustrating the narrowing of camera brands considered by a consumer.\n\n- **AWARENESS:**\n  - ONLINE: Google, Facebook, 500px, ADS, Youtube, Blog, Website\n  - OFFLINE: Cinema, Billboard, Press, FNAC, Friends\n  - Brands considered: NIKON, OLYMPUS, PENTAX, SONY, CANON, PANASONIC\n\n- **FAMILIARITY:**\n  - ONLINE: SEO, Consumer opinion, Social media, Rankings, Mobile Marketing, Newsletter, Website, Blog, Youtube\n  - OFFLINE: Recommendations, Press, Radio, Billboard, Mailing, Catalog, Cinema, POS, Display\n  - Brands considered: PENTAX, SONY, CANON, NIKON, OLYMPUS\n\n- **CONSIDERATION:**\n  - ONLINE: e-Mailing, Consumer opinion, Website, Newsletter, Blog, Youtube\n  - OFFLINE: Recommendations, Press, TV, Offers, Location, Coupons, Word of Mouth, Catalog, Cinema\n  - Brands considered: SONY, CANON, NIKON\n\n- **PURCHASE:**\n  - ONLINE: POS, e-mail Confirmation, Checkout\n  - OFFLINE: Cash register ticket, Receipt\n  - Brand purchased: CANON\n\n- **LOYALTY:**\n  - ONLINE: Newsletter, Social media\n  - OFFLINE: Loyalty card, Mailing"
        }
      ],
      "formulas": [],
      "notes": "The slide presents a simplified, conceptual view of the 5-step purchasing funnel. The circles likely represent different brands or products available to the consumer. This slide provides a practical framework by listing specific channels and touchpoints for each stage of the purchasing funnel. This slide provides a concrete example of the purchasing funnel, making the abstract concepts from the previous slides more tangible. This slide is a slight variation of slide 23. The primary differences are the absence of the illustrative icons (person with camera, etc.) at the start and end of the funnel, and the omission of the specific '5D MK4' model in the loyalty stage.",
      "educational_value": 0.75
    },
    {
      "name": "the construction of personas",
      "slides": [
        1,
        1,
        2,
        2,
        3,
        3,
        4,
        5
      ],
      "main_text": "The construction of Personas\n\n• What is a Persona? [Embedded YouTube Video]\nPERSONAS\n- SHOPPER PERSONAS\n- BUYERS PERSONAS\n\nhttps://www.youtube.com/watch?v=AVs59ddkzuQ\n\nThe construction of Personas\n\n• How do we create them? WHAT? Name: Robert\n\nGOALS\nPrimary goal? Secondary goal? • Intellectual and cultural development\n• Sharing time and experience with her grandchildren\n\nEXPECTATIONS\nPrimary expectation? Secondary expectation? • Quality\n• Emotions\n• Comfort\n• Uniqueness, originality\n\nQUOTES\nAbout goals, expectations, etc. • \"Now I've achieved a successful career, I want to enjoy my life in sharing time with my family\". • \"I love authentic products whose originality, quality and passion for making them can be appreciated.\"\n\n(Kusinitz 2014)\n\nA persona is « a semi-fictional representation of your ideal customer based on market research and real data about your existing customers »\n\nLemon & Verhoef (2016, p.73)\n\nUSER PERSONA\nJane Doe\nABOUT\nJane is a UX Designer that works for a Fortune 500 company in Atlanta, GA. Ever since she was a child, she loved to make stuff on her own and show them to her parents, friends and classmates. Over the course of her childhood and throughout high school, she won numerous design prizes at various art contests both locally and in the United States and Canada. Due to her passion for design, she decided to pursue a Master's degree in Human-Computer Interaction and learn more about User Experience (UX) and how she can become a better designer. \"I design with all my heart, thinking about the users\"\nAGE 21\nJOB TITLE UX Designer\nSTATUS Single\nLOCATION Atlanta, GA\nPASSIONATE EMPATHETIC CURIOUS ADVENTUROUS\nFAVORITE BRANDS\n[Facebook, Spotify, Coca-Cola logos]\nGOALS\n• Become a designer who communicates well her ideas at any place\n• Easily explain her design ideas to other designers, researchers and engineers\nPAIN POINTS\n• There are too many tools that forces her to spend time learning them\n• Cannot rely on other people's opinion because they are highly subjective\n• Certain situations require different tools to communicate her thoughts\nNEEDS\n• Looking for a design tool that helps to cut down unnecessary time and effort\n• Receive feedback on her progress whenever needed before presentation\n\nDrew\nInfluencer\nABOUT\nAge 25-29\nSkill: Vlogger\nHigh tech proficiency\nEVENT ATTENDANCE ATTRIBUTES\nFrequent event goer (monthly). Tied to the city for work. Would travel nationally/internationally for an event. Tends to go to events with a few friends. MOTIVATIONS\nHis favorite thing is to find & share them with network, helping influence. Being the first to know about something and share it gives him a thrill. CORE NEEDS\nFinding events on social media and being able to find tickets easily. Knowing what the trending events that will sell out are. Also, being able to buy tickets last minute with the first to get tickets. PAIN POINTS\nFinding the time to attend events and staying on budget. 39% Total Universe D18+ (Event Goers)\n12 Events per month\n\nhttps://dribbble.com/shots/4152326-Free-Template-User-Persona-Black-White\nhttps://dribbble.com/shots/3338369-User-Personas-attachments/723326\n\nThe construction of Personas\n\n• Why using Personas? Buyer Personas allow companies :\n- To have a clear idea of their different customers through characters (to make alive their segments)\n- Easily adapt, personalize, communicate with each segment (e.g. messages)\n- Mapping the different customer journeys by segments\n\nLemon & Verhoef (2016, p.73)\n\nThe construction of Personas\n\n• Another link on Canva\n\n[Screenshot of Canva website]\n\nCanva\nAccueil\nEntreprise\nEnseignement\nRecherchez des milliers de m... Créer un design\n\nPersonnel\n\nModèles Canva\n\nTous les filtres\nCatégorie\n\n7,415 templates\n\n[Thumbnails of various User Persona templates]\n\nhttps://www.canva.com/templates/s/user-persona/\n\nThe construction of Personas\n\n• What do we need to create them? Buyer personas are created through:\n- Qualitative interviews\n- Surveys\n- Other research (e.g. consumption trends)\n- Data bases (internal or external)\n\n(Kusinitz 2014)\n\nWHO? Name: Robert\n\nBACKGROUND\nJob? Career path? Family? • Head of Marketing Department\n• Worked at the same company for 30 years; he was brand manager before\n• Married with 3 children (25, 29 and 32)\n\nDEMOGRAPHICS\nGender? Age? Income? Location? • Gender male\n• Age 55-60\n• Income: $220,000\n• Suburban, owner\n\nIDENTIFIERS\nPersonality? Behavior? Technology? Social media? • Calm, curious\n• Passionate person who takes a long time before buying a product\n• Try to disconnect from technology to enjoy real life (low use of smartphone and social media)\n• Read HBR and FT\n\n(Kusinitz 2014)",
      "key_concepts": [
        "Persona",
        "Shopper Persona",
        "Buyer Persona",
        "Persona Construction",
        "Goals",
        "Expectations",
        "Quotes",
        "Persona definition",
        "Semi-fictional representation",
        "Ideal customer",
        "Market research",
        "Customer data",
        "User Persona",
        "UX Designer",
        "Influencer",
        "Demographics",
        "Pain Points",
        "Needs",
        "Motivations",
        "Personality Traits",
        "Customer segmentation",
        "Personalization",
        "Targeted communication",
        "Customer journey mapping",
        "Persona Templates",
        "Canva",
        "Design Tools",
        "Resource Sharing",
        "Persona creation methods",
        "Qualitative interviews",
        "Surveys",
        "Consumption trends",
        "Databases",
        "Persona example",
        "Persona components",
        "Background",
        "Identifiers",
        "Personality",
        "Behavior",
        "Technology usage"
      ],
      "definitions": [
        {
          "term": "Persona",
          "definition": "a semi-fictional representation of your ideal customer based on market research and real data about your existing customers"
        }
      ],
      "examples": [
        "A persona named 'Robert' who is a career-successful individual valuing family, culture, and authentic products.",
        "Jane Doe, a 21-year-old UX Designer from Atlanta.",
        "Drew, a 25-29 year old influencer and vlogger.",
        "Using personas to adapt and communicate with segments, for example, through targeted 'messages'.",
        "The numerous user persona templates available on Canva.",
        "'consumption trends' is given as an example of 'Other research'.",
        "The entire slide is a detailed example of a persona named 'Robert'.",
        "Robert reads HBR (Harvard Business Review) and FT (Financial Times)."
      ],
      "diagrams": [
        {
          "type": "embedded video",
          "key_points": [
            "The slide introduces the concept of Personas via a video.",
            "The video distinguishes between Shopper Personas and Buyer Personas."
          ],
          "description": "An embedded YouTube video player is shown. The video is paused at 0:11 of a 2:43 total length. The video thumbnail or initial frame displays the word 'PERSONAS' in large, orange, handwritten-style font, with '- SHOPPER PERSONAS' and '- BUYERS PERSONAS' written below it. The standard YouTube player controls (play/pause, volume, settings, fullscreen) are visible at the bottom."
        },
        {
          "type": "table",
          "key_points": [
            "GOALS include intellectual/cultural development and sharing time with grandchildren.",
            "EXPECTATIONS include quality, emotions, comfort, and uniqueness.",
            "QUOTES reflect the persona's life stage and values regarding authenticity and family."
          ],
          "description": "A three-section table outlining the components of a persona named 'Robert'. The sections are GOALS, EXPECTATIONS, and QUOTES, each with guiding questions and example answers."
        },
        {
          "type": "slider chart",
          "key_points": [
            "Leans towards Extrovert",
            "Leans towards Creative",
            "Leans towards Organized",
            "Leans towards Team player",
            "Leans towards Independent"
          ],
          "description": "A set of five horizontal sliders representing Jane Doe's personality on a spectrum between two opposing traits: Introvert/Extrovert, Analytical/Creative, Busy/Organized, Messy/Team player, Independent/Dependent."
        },
        {
          "type": "checklist",
          "key_points": [
            "Friends",
            "Cultural",
            "Location",
            "Learning",
            "Networking",
            "Price",
            "Credibility"
          ],
          "description": "A checklist titled 'EVENT INFLUENCERS' for the persona Drew. It lists factors that influence his event attendance, with all items checked."
        },
        {
          "type": "website screenshot",
          "key_points": [
            "Canva is presented as a tool for creating personas.",
            "A large number of templates (7,415) are available.",
            "Templates shown have titles like 'Navy and Beige M...', 'User Persona Com...', 'Introduction of User Personas'."
          ],
          "description": "A screenshot of the Canva website showing the results for a search on 'User Personas'. The page displays a grid of 7,415 available templates with various designs and layouts for creating personas."
        },
        {
          "type": "table/profile",
          "key_points": [
            "The profile provides a concrete example of how data is synthesized into a persona.",
            "It includes professional background, family details, demographic data, and psychographic identifiers like personality traits and media consumption habits."
          ],
          "description": "A structured profile of a persona named 'Robert'. The profile is divided into three main sections: BACKGROUND, DEMOGRAPHICS, and IDENTIFIERS. Each section has guiding questions (e.g., 'Job? Career path? Family?') and bullet points with specific details about Robert."
        }
      ],
      "formulas": [],
      "notes": "The slide number is 26. The footer includes the Audencia logo and logos for EQUIS, AACSB, AMBA, CEFDG, CONFERENCE DES GRANDES ECOLES, and coafm. This slide introduces the basic components of a persona using a simple template. The large 'WHAT?' suggests this slide defines what a persona consists of. A source, (Kusinitz 2014), is cited. The slide number is 27. The source for the definition is cited as Lemon & Verhoef (2016, p.73). This slide provides two detailed, visually distinct examples of user personas, showcasing different layouts and information categories. It serves as a practical illustration of how to create rich, comprehensive personas. Dribbble links are provided as sources for the templates. The slide number is 28. The source is cited as Lemon & Verhoef (2016, p.73). This slide provides a practical resource for students, directing them to Canva as a tool to find and use pre-made templates for constructing their own personas. A direct URL is provided at the bottom. The slide number is 29. The source is cited as (Kusinitz 2014). The slide number is 30. The source is cited as (Kusinitz 2014).",
      "educational_value": 1.0
    },
    {
      "name": "never stop daring",
      "slides": [
        1
      ],
      "main_text": "Audencia\naudencia.com\n\nNEVER STOP DARING\n\n\"\nCultiver l'audace, toujours et à tout âge,\ncroire en soi, se lancer, innover,\napprendre de ses échecs,\nse relever et recommencer.\nS'engager avec et pour les autres,\nagir en manager responsable,\nrespectueux et bienveillant,\nimpacter positivement la société.\n\nL'audace nous grandit,\nélargit notre horizon,\nnourrit notre imagination\npour mieux transformer le monde.\n\"",
      "key_concepts": [
        "Audacity (L'audace)",
        "Innovation",
        "Resilience",
        "Responsible Management",
        "Societal Impact",
        "Lifelong Learning",
        "Branding"
      ],
      "definitions": [
        {
          "term": "L'audace (Audacity)",
          "definition": "According to the slide, audacity is a quality to be cultivated at all ages. It involves believing in oneself, launching initiatives, innovating, learning from failures, recovering and starting again. It also entails engaging with and for others, acting as a responsible, respectful, and caring manager, and positively impacting society. It is presented as a force for personal growth, broadening horizons, and fueling imagination to transform the world."
        }
      ],
      "examples": [],
      "diagrams": [],
      "formulas": [],
      "notes": "This slide is a branding statement for the Audencia business school. The central theme is 'daring' (audace), which is framed as a core value encompassing personal development, professional ethics, and a commitment to positive societal change. The visual design, with the vertical 'DARING', reinforces the bold and dynamic message.",
      "educational_value": 0.65
    },
    {
      "name": "gen ai is reshaping customer journeys",
      "slides": [
        5
      ],
      "main_text": "Gen AI is reshaping customer journeys\n\nIllustrative\n\nhttps://www.bcg.com/publications/2024/three-ways-genai-will-transform-customer-experience\nhttps://www.bain.com/insights/generative-ai-potential-to-improve-customer-experience/\nhttps://onlinelibrary.wiley.com/doi/10.1002/mar.70036\n\nSource: BCG analysis.",
      "key_concepts": [
        "Generative AI (Gen AI)",
        "Customer Journey",
        "Personalized Advertising",
        "Augmented Reality",
        "Interactive Assistant",
        "Cost to Serve",
        "Customer Loyalty",
        "Cross-sell",
        "Up-sell"
      ],
      "definitions": [],
      "examples": [
        "Receiving personalized advertising with AI-generated content.",
        "Using an interactive assistant to browse a catalog.",
        "Using GenAI and augmented reality to demonstrate products in a physical space.",
        "Using auto-generated user guides and tutorials after purchase.",
        "A call center agent using AI dynamic scripts to troubleshoot a query.",
        "An agent receiving next-best-action prompts for cross-selling during a call."
      ],
      "diagrams": [
        {
          "type": "flowchart",
          "key_points": [
            "Gen AI can be applied across the entire customer journey, from discovery to post-purchase support.",
            "In the purchase phase, Gen AI can improve click-through rates, conversion, and brand awareness.",
            "In the post-purchase phase, Gen AI can lower returns, reduce service costs, and increase loyalty through better support and up-selling."
          ],
          "description": "A diagram showing two customer journey flows and how Gen AI can impact them. The top flow represents the purchase journey (Discovery -> Research -> Comparison -> Purchase decision -> Payment -> Delivery). The bottom flow represents the post-purchase journey (Setup -> Use -> Issue resolution -> Reconsideration). Callout boxes link specific Gen AI applications to business outcomes at various stages. For example, 'I receive personalized advertising with AI-generated content and images' leads to 'Improved click-through rate' at the Discovery stage. 'I talk to a call center agent who uses AI dynamic scripts to troubleshoot my query' leads to 'Reduced cost to serve' at the Issue resolution stage."
        }
      ],
      "formulas": [],
      "notes": "Slide number 20. The slide is illustrative and cites 'BCG analysis' as the source. It includes links to articles from BCG, Bain, and Wiley for further reading.",
      "educational_value": 0.9
    },
    {
      "name": "le wagon first sessions",
      "slides": [
        5
      ],
      "main_text": "• How it works\n• Make sure you received an e-mail explaining how to access the platform\n• Check the video on BlackBoard that explains how to approach these 2 online sessions\n• Before next off-line session (in 2 weeks), you MUST go through the following contents on LeWagon :\n  • Introduction\n  • Using Designer Tools\n  • Product Pitch\n  • UX Personas\n  • User Journeys\n  • User flow",
      "key_concepts": [
        "Le Wagon",
        "BlackBoard",
        "Online Sessions",
        "Designer Tools",
        "Product Pitch",
        "UX Personas",
        "User Journeys",
        "User flow"
      ],
      "definitions": [],
      "examples": [
        "The list of contents to complete on LeWagon: Introduction, Using Designer Tools, Product Pitch, UX Personas, User Journeys, User flow."
      ],
      "diagrams": [
        {
          "type": "screenshot",
          "key_points": [
            "The screenshot provides a visual guide to the Le Wagon platform.",
            "It shows the structure of the course content students need to navigate.",
            "A specific video presentation is highlighted as an important resource."
          ],
          "description": "A screenshot of the Le Wagon online learning platform interface is shown on the right side of the slide. It displays a course curriculum with sections like 'Product Design', 'Product Pitch', and 'UX Deep Dive'. Specific modules listed include 'WELCOME, WAGON', 'WIREFRAMING', 'BRANDING & UI', and 'UI KITS'. A red box highlights a video thumbnail titled 'Le Wagon Video Presentation'."
        }
      ],
      "formulas": [],
      "notes": "This slide provides instructions for students on how to prepare for the Le Wagon sessions. It sets a deadline ('in 2 weeks') and lists mandatory content to be completed. The slide number is 40.",
      "educational_value": 0.49999999999999994
    }
  ],
  "semantic_chunks": [
    {
      "topics": [
        "the customer journey"
      ],
      "content": "## Topic: The Customer Journey\n(Source slides: 1, 1, 1, 2, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 5)\n\n### Content\n• Pre purchase, purchase and post purchase stages\n\nPurchase Stage:\nThis stage encompasses all customer interactions with the brand during the purchase. It includes behaviors such as choice, ordering, and payment. It is considered as the most “temporally compressed” of the three stages.\n\nThe Customer Journey\n\n- Types of Touch Points\n\nPartner-owned touch points:\n\nThese touch points are jointly designed, controlled and managed by the firm and its partner(s). The partners could be multivendor partners, multichannel distributors partners, communication partners, etc.\n\nThe Customer Journey\n\n- Types of Touch Points\n\nSocial/external touch points:\n\nThese touch points are all external people that may influence the customer experience. It may concerns the advices of customers (e.g. Comments on TripAdvisor) or peer influences, independent information sources, etc. Sometimes influencers may be independent and sometimes they are in line with firm expectations. Lemon & Verhoef (2016)\n\nIt includes the use/consumption of the product/service, and service requests. It is an important phase where the customer will evaluate his shopping experience. Based on this evaluation, he will engage or not with the brand, become loyal or not, use negative or positive W.O.M’s.\n\n• Today's exercise\n\nCustomer activities\n(what is the customer doing?)\n\nExperience (what is the customer's feeling : positive, negative, neutral; High versus Low)\n\nTouchpoints\n\n• Types of Touch Points\n\nBrand-owned touch points:\nThese touch points customer interactions are designed, controlled and managed by the firm. It may concern the marketing mix (products, price strategy, service, distribution) and more broadly the brand owned media such as advertising, websites, loyalty programs, etc.\n\nThe Customer Journey Map\n\n- What are the steps in a customer journey? Customer activities\n(what is the customer doing?)\n\nExperience (what is the customer's feeling : positive, negative, neutral; High versus Low)\n\nTouchpoints\n\n• Example Nike\n\nhttps://www.questionpro.com/blog/nike-customer-experience/\n\nThe Customer Journey\n\nOverview of the Customer Journey\n\nFeedback\n\nPREVIOUS EXPERIENCE (t-n)\nPrepurchase Stage\nPurchase Stage\nPostpurchase Stage\n\nCURRENT EXPERIENCE (t)\nPre purchase Stage\nTouchpoints: Brand owned, partner owned, customer owned, social/external\nBehaviors: need recognition, consideration, search\n\nPurchase Stage\nTouchpoints: Brand owned, partner owned, customer owned, social/external\nBehaviors: choice, ordering, payment\n\nPost purchase Stage\nTouchpoints: Brand owned, partner owned, customer owned, social/external\nBehaviors: consumption, usage, engagement, service requests\n\nFUTURE EXPERIENCE (t+n)\nPrepurchase Stage\nPurchase Stage\nPostpurchase Stage\n\nCustomer Journey\n\nExtracted from Lemon & Verhoef (2016, p. 77)\n\nThe Customer Journey\n\n- Types of Touch Points\n\nCustomer-owned touch points:\n\nThese touch points concerned all customer actions that are part of the customer experience. The company, its partners or others do not influence or control these actions. These actions may include customers reflecting on their needs and desires and the transformation of a company product into a use not intended by the firm.\n\nThe Customer Journey Map\n\n- Example\n\nhttps://miro.com/miroverse/fly-ux-customer-journey-map/\n\nFly UX - Customer Journey Map\n\nFly UX Customer Journey Map by Eva Huse Pedersen\nMiro.com\n\nThe Customer Journey\n\nPre purchase, purchase and post purchase stages\n\nPre purchase Stage:\nThis stage encompasses all direct or indirect customer interactions with the brand before the purchase. It generally starts with the “need/goal/impulse recognition to consideration of satisfying that need/goal/impulse with a purchase” including the search stage (Lemon & Verhoef, 2016, p.76).\n\nNike Customer Journey\n\n• Today's exercise\n\n• Groups of 2\n\n• Create a persona corresponding to a segment of the Nike brand. • Map the customer journey of this persona to buy Nike sneakers online\n\n• Be ready to present in front of everyone 🙂\n\n### Definitions\n- **Purchase Stage**: This stage encompasses all customer interactions with the brand during the purchase. It includes behaviors such as choice, ordering, and payment. It is considered as the most “temporally compressed” of the three stages.\n- **Partner-owned touch points**: These touch points are jointly designed, controlled and managed by the firm and its partner(s). The partners could be multivendor partners, multichannel distributors partners, communication partners, etc.\n- **Social/external touch points**: These touch points are all external people that may influence the customer experience. It may concerns the advices of customers (e.g. Comments on TripAdvisor) or peer influences, independent information sources, etc. Sometimes influencers may be independent and sometimes they are in line with firm expectations.\n- **Post purchase Stage**: The last stage concerns all interactions with the brand and its environment after purchase. It includes the use/consumption of the product/service, and service requests. It is an important phase where the customer will evaluate his shopping experience. Based on this evaluation, he will engage or not with the brand, become loyal or not, use negative or positive W.O.M’s.\n- **Brand-owned touch points**: These touch points customer interactions are designed, controlled and managed by the firm. It may concern the marketing mix (products, price strategy, service, distribution) and more broadly the brand owned media such as advertising, websites, loyalty programs, etc.\n- **Customer-owned touch points**: These touch points concerned all customer actions that are part of the customer experience. The company, its partners or others do not influence or control these actions. These actions may include customers reflecting on their needs and desires and the transformation of a company product into a use not intended by the firm.\n- **Pre purchase Stage**: This stage encompasses all direct or indirect customer interactions with the brand before the purchase. It generally starts with the “need/goal/impulse recognition to consideration of satisfying that need/goal/impulse with a purchase” including the search stage (Lemon & Verhoef, 2016, p.76).\n\n### Key Concepts: Customer Journey, Purchase Stage, Pre purchase, Post purchase, Touchpoints, Behaviors, Temporally compressed, Touch Points, Partner-owned touch points, Social/external touch points, Customer Experience, Peer Influence, Influencers, Post purchase Stage, Customer Evaluation, Brand Loyalty, Word-of-Mouth (W.O.M.), Consumption, Service Requests, E-commerce, Multichannel distributor, Influencer Marketing, Social Media, Product Reviews, Customer Journey Mapping, Prepurchase, Purchase, Postpurchase, Customer Activities, Brand-owned touch points, Marketing Mix, Brand owned media, Sponsorship, Communication partner, Customer Journey Map, Customer Journey Stages, Awareness, Consideration, Decision, Service, Loyalty, Touchpoint, Customer Actions, Experience, Pain Points, Potential Solution, Customer Journey Overview, Previous Experience, Current Experience, Future Experience, Pre-purchase Stage, Post-purchase Stage, Customer Behaviors, Feedback Loop, Brand Touchpoints, Pre-purchase, Post-purchase, Customer-owned touch points, Unintended product use, User Experience (UX), Customer Goals, Customer Behaviours, Journey Stages, Customer Interactions, Need Recognition, Search Stage, Website, Advertising, Product Customization, User-generated content, Product modification, IKEA Hacking, Persona Application, Brand Segmentation, Group Exercise, Presentation\n\n### Examples\n- multivendor partners\n- multichannel distributors partners\n- communication partners\n- Comments on TripAdvisor\n- The 'wethenew' website selling Air Jordan sneakers is an example of a partner-owned touch point, specifically a multichannel distributor.\n- A screenshot of a YouTube video titled 'Air Jordan 1 Mid Chicago Black Toe REVIEW and ON-FEET!', showing a product review which is a form of external touchpoint.\n- A screenshot of an Instagram post from the influencer 'xsqueezie' announcing a collaboration with Nike. The caption (in French) discusses a new fitness program in partnership with Nike, illustrating an influencer acting as an external touchpoint in line with firm expectations.\n- Gillette\n- Mitsubishi\n- Coca-Cola\n- IBM\n- Walt Disney\n- MasterCard\n- Nescafé\n- Visa\n- BIC\n- Philips\n- Ford\n- FedEx\n- Esso\n- Vodafone\n- Pampers\n- IKEA\n- Intel\n- Microsoft\n- Bosch\n- Durex\n- Heineken\n- Adobe\n- Red Bull\n- Samsung\n- A sponsored sports team (like the French national football team) is an example of a partner-owned touch point, representing a communication partnership.\n- The entire slide is a detailed example of a Customer Journey Map for the brand Nike.\n- Customers reflecting on their needs and desires.\n- The transformation of a company product into a use not intended by the firm.\n- The entire 'Fly UX - Customer Journey Map' is an example. Specific pain points mentioned include communication issues, confusing options, language barriers on the website, and lack of clarity on fare inclusions.\n- Nike's e-commerce website\n- Nike's print/digital advertising\n- Nike's product customization service ('Nike By You')\n- The 'IKEA hackers' website, where customers share modifications to IKEA products, is an example of a customer-owned touch point.\n- The exercise itself is an example: creating a persona for a Nike brand segment and mapping their journey to buy sneakers online.\n\n### Visual Elements\n- [flowchart] A flowchart diagram illustrates the three stages of the customer journey as three sequential, overlapping chevrons pointing from left to right. The first stage is 'Prepurchase Stage' in blue. The middle stage, 'Purchase Stage', is highlighted in yellow. The final stage is 'Postpurchase Stage' in blue. Each chevron contains information about its respective touchpoints and behaviors.\n  Key points: Prepurchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: need recognition, consideration, search., Purchase Stage (Yellow Highlighted Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: choice, ordering, payment., Postpurchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: consumption, usage, engagement, service requests.\n- [flowchart] A flowchart diagram illustrates the three stages of the customer journey as three sequential, overlapping chevrons pointing from left to right. The first stage is 'Prepurchase Stage' in blue. The middle stage is 'Purchase Stage' in blue. The final stage, 'Postpurchase Stage', is highlighted in yellow. Each chevron contains information about its respective touchpoints and behaviors.\n  Key points: Prepurchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: need recognition, consideration, search., Purchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: choice, ordering, payment., Postpurchase Stage (Yellow Highlighted Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: consumption, usage, engagement, service requests.\n- [screenshot] A screenshot of a product page from the e-commerce website 'wethenew'. The page displays the 'Air Jordan 1 Mid Chicago Black Toe' sneaker. Key elements shown are the product image, product name, price (€280.00), installment payment options (2x, 3x, 4x), loyalty points (+280 points de fidélité), size selection (TAILLE), a guide to sizes (GUIDE DES TAILLES), an 'Add to cart' button (Ajouter au panier), and delivery information (48H Livraison). The top navigation includes a search bar, user account, wishlist, and cart icons.\n  Key points: Product: Air Jordan 1 Mid Chicago Black Toe, Retailer: wethenew, Price: €280.00, Features: Installment payments, loyalty program, express delivery.\n- [flowchart and table] The slide presents a template for a customer journey map. At the top, a flowchart shows three main phases: 'Prepurchase', 'Purchase', and 'Postpurchase', connected by arrows. Below this, a red bar is divided into six sequential steps: 'Step 1' through 'Step 6'. The main body is a table with three rows labeled: 'Customer activities (what is the customer doing?)', 'Experience (what is the customer's feeling : positive, negative, neutral; High versus Low)', and 'Touchpoints'. The table columns correspond to the six steps and are currently empty, intended for an exercise.\n  Key points: The customer journey is divided into three main phases: Prepurchase, Purchase, and Postpurchase., The journey is further broken down into 6 specific steps., The map tracks three key aspects at each step: Customer activities, Experience/Feelings, and Touchpoints.\n- [image collage] A collage of numerous well-known brand logos, serving as examples of brands that manage their own touch points.\n- [framework/table] A template for a customer journey map. It has a timeline at the top divided into three main stages: Prepurchase, Purchase, and Postpurchase. Below this, the timeline is marked with six steps (Step 1 to Step 6). Step 1, 2, 3 are under Prepurchase; Step 4 is under Purchase; Step 5, 6 are under Postpurchase. The rows below are categories for analysis at each step: 'Customer activities (what is the customer doing?)', 'Experience (what is the customer's feeling : positive, negative, neutral; High versus Low)', and 'Touchpoints'.\n  Key points: The customer journey is divided into Prepurchase, Purchase, and Postpurchase stages., Each stage consists of multiple steps., For each step, the map analyzes customer activities, their emotional experience, and the touchpoints they interact with.\n- [table/matrix] A detailed customer journey map for the brand Nike, structured as a grid. The columns represent the five stages of the journey: Awareness, Consideration, Decision, Service, and Loyalty. The rows represent different aspects of the customer experience: TOUCHPOINT, Customer Actions, Experience, Pain Points, and Potential Solution. The 'Experience' row includes a line graph with emoticons (sad, neutral, happy, frustrated, very happy) plotting the emotional journey of the customer through the stages. Each cell in the grid contains specific information for Nike. For example, in the 'Awareness' stage, the touchpoint is 'Nike.com', the customer action is visiting the website, the pain point is 'Difficulty in finding desired items', and the potential solution is to 'Enhance website navigation and search functionality'.\n  Key points: Awareness Stage: Touchpoint is Nike.com; customer feels interested but hesitant due to difficulty finding items., Consideration Stage: Touchpoint is Product Pages; customer is curious but faces uncertainty about product features., Decision Stage: Touchpoint is Online Shopping; customer is excited but faces a lengthy checkout process., Service Stage: Touchpoint is Returns and Exchanges; customer is frustrated due to complicated return processes., Loyalty Stage: Touchpoint is Exclusive Drops; customer is satisfied and happy but has limited opportunities for early access.\n- [flowchart] A flowchart illustrating the Customer Journey over time. It is divided into three main columns: 'PREVIOUS EXPERIENCE (t-n)', 'CURRENT EXPERIENCE (t)', and 'FUTURE EXPERIENCE (t+n)'. A large yellow arrow labeled 'Customer Journey' flows from left to right underneath these columns. The 'CURRENT EXPERIENCE' column is further subdivided into three sequential stages: 'Pre purchase Stage' (green), 'Purchase Stage' (yellow), and 'Post purchase Stage' (orange). Each of these stages lists associated 'Touchpoints' and 'Behaviors'. Specifically:\n- Pre purchase Stage: Touchpoints include Brand owned, partner owned, customer owned, social/external. Behaviors include need recognition, consideration, search.\n- Purchase Stage: Touchpoints include Brand owned, partner owned, customer owned, social/external. Behaviors include choice, ordering, payment.\n- Post purchase Stage: Touchpoints include Brand owned, partner owned, customer owned, social/external. Behaviors include consumption, usage, engagement, service requests.\nA 'Feedback' loop is shown with arrows pointing from the Current Experience stages back to influence the Previous Experience.\n  Key points: The customer journey is a process over time, influenced by past experiences and shaping future ones., The current experience is comprised of pre-purchase, purchase, and post-purchase stages., Each stage involves various touchpoints (brand, partner, customer, and social/external owned)., Each stage is characterized by specific customer behaviors., There is a feedback mechanism where the current experience informs future 'previous experiences'.\n- [concept map] A diagram titled 'BRAND TOUCHPOINTS' which maps various touchpoints to the three customer journey stages. The stages (PRE-PURCHASE, PURCHASE, POST-PURCHASE) are listed at the bottom. An overarching orange arrow labeled 'CUSTOMER EXPERIENCE' spans the top. Touchpoints are represented as colored circles (blue and orange) and are grouped under their relevant stage.\n  Key points: PRE-PURCHASE Touchpoints: SOCIAL MEDIA, ADS, MARKETING, DISPLAYS, PROMOS, EMAIL, DIRECT MAIL, PR, WORD OF MOUTH., PURCHASE Touchpoints: SALES PERSON, UP SALE, PACKAGING, ECOMMERCE, WEB, STORE OR OFFICE, CATALOGUE., POST-PURCHASE Touchpoints: INVOICE, EVENTS, SURVEYS, CUSTOMER SERVICE, BILLING, FORUMS, SOCIAL MEDIA, NEWS LETTER, LOYALTY PROGRAM, BRAND PROMISE.\n- [table/chart] An example of a detailed Customer Journey Map for a fictional airline, 'Fly UX'. The map is a grid with columns representing stages of the journey and rows representing different aspects of the customer experience. \n- Stages (Columns): Awareness, Consideration, Booking Page - Search flight, Flight Search Result, Select Fare. \n- Aspects (Rows): Goals, Behaviours, Connect, Pain Points. \nEach cell contains bullet points detailing the customer's experience at that stage. For example, under 'Consideration', a 'Pain Point' is 'The options are changing very quickly and that makes it confusing'. Under 'Select Fare', a 'Goal' is 'I want to understand what value I get for the price' and a 'Pain Point' is 'I am not sure what is included in the fare'.\n  Key points: The map provides a step-by-step analysis of a customer's interaction with a service., It tracks customer goals, behaviors, and pain points at each stage., Identifying pain points is crucial for improving the overall customer experience.\n- [diagram] A simplified visual representation of the customer journey stages, shown as three connected chevrons pointing from left to right. The first chevron is green and labeled 'Prepurchase Stage', listing 'Touchpoints: Brand owned, partner owned, customer owned, social/external' and 'Behaviors: need recognition, consideration, search'. The subsequent chevrons for 'Purchase Stage' and 'Postpurchase Stage' are shaded in blue and contain similar labels for touchpoints and behaviors, though the text is less prominent. The Pre-purchase stage is visually highlighted.\n  Key points: The Pre-purchase stage is the first phase of the customer journey., It involves specific touchpoints and behaviors like need recognition and search.\n- [image examples] The slide displays three visual examples of Nike's brand-owned touch points. 1) Top-left: A screenshot of the Nike e-commerce website, showing a promotional banner for '30% OFF EVERYTHING'. 2) Bottom-left: A Nike advertisement with a young girl running, featuring the slogan 'It's only a crazy dream until you do it. Just do it.'. 3) Right: A screenshot of the Nike 'By You' product customization page, showing a personalized shoe and the text 'Chaussures Personnalisées Nike By You'.\n  Key points: Example 1: Nike website with a '30% OFF EVERYTHING' promotion., Example 2: Nike 'Just do it.' advertisement with the tagline 'It's only a crazy dream until you do it.', Example 3: Nike 'By You' product customization tool, labeled in French 'Chaussures Personnalisées Nike By You'.\n- [screenshot] A screenshot of the 'IKEA hackers' website homepage. The logo is a stylized version of the IKEA logo. The main navigation includes HACKS, IDEAS, BEST OF, START HERE, SUBMIT HACK, and SHOP. The main heading is 'HACKS'. The text describes how to transform, upcycle, and customize IKEA furniture. It mentions specific examples like adding legs to a KALLAX shelf or creating LEGO storage. Below this is a section titled 'Popular Ikea Hacking Categories' with image links to 'Living Room', 'Dining', 'Dividers', and 'Desks'.\n  Key points: Website: IKEA hackers, Concept: Modifying and customizing IKEA products., Functionality: Showcasing ideas, categories, and allowing users to submit hacks., Example of: Transformation of a product for unintended uses, a customer-owned touch point.\n- [icon] An icon in the bottom right corner shows a message/chat interface with a large red circle containing a white clock symbol overlaid on top of it, suggesting a timed activity or presentation.",
      "key_concepts": [
        "Customer Journey",
        "Purchase Stage",
        "Pre purchase",
        "Post purchase",
        "Touchpoints",
        "Behaviors",
        "Temporally compressed",
        "Touch Points",
        "Partner-owned touch points",
        "Social/external touch points"
      ],
      "educational_value": 1.0
    },
    {
      "topics": [
        "the construction of personas"
      ],
      "content": "\n\n==================================================\n## Topic: The Construction Of Personas\n(Source slides: 1, 1, 2, 2, 3, 3, 4, 5)\n\n### Content\nThe construction of Personas\n\n• What is a Persona? [Embedded YouTube Video]\nPERSONAS\n- SHOPPER PERSONAS\n- BUYERS PERSONAS\n\nhttps://www.youtube.com/watch?v=AVs59ddkzuQ\n\nThe construction of Personas\n\n• How do we create them? WHAT? Name: Robert\n\nGOALS\nPrimary goal? Secondary goal? • Intellectual and cultural development\n• Sharing time and experience with her grandchildren\n\nEXPECTATIONS\nPrimary expectation? Secondary expectation? • Quality\n• Emotions\n• Comfort\n• Uniqueness, originality\n\nQUOTES\nAbout goals, expectations, etc. • \"Now I've achieved a successful career, I want to enjoy my life in sharing time with my family\". • \"I love authentic products whose originality, quality and passion for making them can be appreciated.\"\n\n(Kusinitz 2014)\n\nA persona is « a semi-fictional representation of your ideal customer based on market research and real data about your existing customers »\n\nLemon & Verhoef (2016, p.73)\n\nUSER PERSONA\nJane Doe\nABOUT\nJane is a UX Designer that works for a Fortune 500 company in Atlanta, GA. Ever since she was a child, she loved to make stuff on her own and show them to her parents, friends and classmates. Over the course of her childhood and throughout high school, she won numerous design prizes at various art contests both locally and in the United States and Canada. Due to her passion for design, she decided to pursue a Master's degree in Human-Computer Interaction and learn more about User Experience (UX) and how she can become a better designer. \"I design with all my heart, thinking about the users\"\nAGE 21\nJOB TITLE UX Designer\nSTATUS Single\nLOCATION Atlanta, GA\nPASSIONATE EMPATHETIC CURIOUS ADVENTUROUS\nFAVORITE BRANDS\n[Facebook, Spotify, Coca-Cola logos]\nGOALS\n• Become a designer who communicates well her ideas at any place\n• Easily explain her design ideas to other designers, researchers and engineers\nPAIN POINTS\n• There are too many tools that forces her to spend time learning them\n• Cannot rely on other people's opinion because they are highly subjective\n• Certain situations require different tools to communicate her thoughts\nNEEDS\n• Looking for a design tool that helps to cut down unnecessary time and effort\n• Receive feedback on her progress whenever needed before presentation\n\nDrew\nInfluencer\nABOUT\nAge 25-29\nSkill: Vlogger\nHigh tech proficiency\nEVENT ATTENDANCE ATTRIBUTES\nFrequent event goer (monthly). Tied to the city for work. Would travel nationally/internationally for an event. Tends to go to events with a few friends. MOTIVATIONS\nHis favorite thing is to find & share them with network, helping influence. Being the first to know about something and share it gives him a thrill. CORE NEEDS\nFinding events on social media and being able to find tickets easily. Knowing what the trending events that will sell out are. Also, being able to buy tickets last minute with the first to get tickets. PAIN POINTS\nFinding the time to attend events and staying on budget. 39% Total Universe D18+ (Event Goers)\n12 Events per month\n\nhttps://dribbble.com/shots/4152326-Free-Template-User-Persona-Black-White\nhttps://dribbble.com/shots/3338369-User-Personas-attachments/723326\n\nThe construction of Personas\n\n• Why using Personas? Buyer Personas allow companies :\n- To have a clear idea of their different customers through characters (to make alive their segments)\n- Easily adapt, personalize, communicate with each segment (e.g. messages)\n- Mapping the different customer journeys by segments\n\nLemon & Verhoef (2016, p.73)\n\nThe construction of Personas\n\n• Another link on Canva\n\n[Screenshot of Canva website]\n\nCanva\nAccueil\nEntreprise\nEnseignement\nRecherchez des milliers de m... Créer un design\n\nPersonnel\n\nModèles Canva\n\nTous les filtres\nCatégorie\n\n7,415 templates\n\n[Thumbnails of various User Persona templates]\n\nhttps://www.canva.com/templates/s/user-persona/\n\nThe construction of Personas\n\n• What do we need to create them? Buyer personas are created through:\n- Qualitative interviews\n- Surveys\n- Other research (e.g. consumption trends)\n- Data bases (internal or external)\n\n(Kusinitz 2014)\n\nWHO? Name: Robert\n\nBACKGROUND\nJob? Career path? Family? • Head of Marketing Department\n• Worked at the same company for 30 years; he was brand manager before\n• Married with 3 children (25, 29 and 32)\n\nDEMOGRAPHICS\nGender? Age? Income? Location? • Gender male\n• Age 55-60\n• Income: $220,000\n• Suburban, owner\n\nIDENTIFIERS\nPersonality? Behavior? Technology? Social media? • Calm, curious\n• Passionate person who takes a long time before buying a product\n• Try to disconnect from technology to enjoy real life (low use of smartphone and social media)\n• Read HBR and FT\n\n(Kusinitz 2014)\n\n### Definitions\n- **Persona**: a semi-fictional representation of your ideal customer based on market research and real data about your existing customers\n\n### Key Concepts: Persona, Shopper Persona, Buyer Persona, Persona Construction, Goals, Expectations, Quotes, Persona definition, Semi-fictional representation, Ideal customer, Market research, Customer data, User Persona, UX Designer, Influencer, Demographics, Pain Points, Needs, Motivations, Personality Traits, Customer segmentation, Personalization, Targeted communication, Customer journey mapping, Persona Templates, Canva, Design Tools, Resource Sharing, Persona creation methods, Qualitative interviews, Surveys, Consumption trends, Databases, Persona example, Persona components, Background, Identifiers, Personality, Behavior, Technology usage\n\n### Examples\n- A persona named 'Robert' who is a career-successful individual valuing family, culture, and authentic products.\n- Jane Doe, a 21-year-old UX Designer from Atlanta.\n- Drew, a 25-29 year old influencer and vlogger.\n- Using personas to adapt and communicate with segments, for example, through targeted 'messages'.\n- The numerous user persona templates available on Canva.\n- 'consumption trends' is given as an example of 'Other research'.\n- The entire slide is a detailed example of a persona named 'Robert'.\n- Robert reads HBR (Harvard Business Review) and FT (Financial Times).\n\n### Visual Elements\n- [embedded video] An embedded YouTube video player is shown. The video is paused at 0:11 of a 2:43 total length. The video thumbnail or initial frame displays the word 'PERSONAS' in large, orange, handwritten-style font, with '- SHOPPER PERSONAS' and '- BUYERS PERSONAS' written below it. The standard YouTube player controls (play/pause, volume, settings, fullscreen) are visible at the bottom.\n  Key points: The slide introduces the concept of Personas via a video., The video distinguishes between Shopper Personas and Buyer Personas.\n- [table] A three-section table outlining the components of a persona named 'Robert'. The sections are GOALS, EXPECTATIONS, and QUOTES, each with guiding questions and example answers.\n  Key points: GOALS include intellectual/cultural development and sharing time with grandchildren., EXPECTATIONS include quality, emotions, comfort, and uniqueness., QUOTES reflect the persona's life stage and values regarding authenticity and family.\n- [slider chart] A set of five horizontal sliders representing Jane Doe's personality on a spectrum between two opposing traits: Introvert/Extrovert, Analytical/Creative, Busy/Organized, Messy/Team player, Independent/Dependent.\n  Key points: Leans towards Extrovert, Leans towards Creative, Leans towards Organized, Leans towards Team player, Leans towards Independent\n- [checklist] A checklist titled 'EVENT INFLUENCERS' for the persona Drew. It lists factors that influence his event attendance, with all items checked.\n  Key points: Friends, Cultural, Location, Learning, Networking, Price, Credibility\n- [website screenshot] A screenshot of the Canva website showing the results for a search on 'User Personas'. The page displays a grid of 7,415 available templates with various designs and layouts for creating personas.\n  Key points: Canva is presented as a tool for creating personas., A large number of templates (7,415) are available., Templates shown have titles like 'Navy and Beige M...', 'User Persona Com...', 'Introduction of User Personas'.\n- [table/profile] A structured profile of a persona named 'Robert'. The profile is divided into three main sections: BACKGROUND, DEMOGRAPHICS, and IDENTIFIERS. Each section has guiding questions (e.g., 'Job? Career path? Family?') and bullet points with specific details about Robert.\n  Key points: The profile provides a concrete example of how data is synthesized into a persona., It includes professional background, family details, demographic data, and psychographic identifiers like personality traits and media consumption habits.",
      "key_concepts": [
        "Persona",
        "Shopper Persona",
        "Buyer Persona",
        "Persona Construction",
        "Goals",
        "Expectations",
        "Quotes",
        "Persona definition",
        "Semi-fictional representation",
        "Ideal customer",
        "Market research",
        "Customer data",
        "User Persona",
        "UX Designer",
        "Influencer"
      ],
      "educational_value": 1.0
    },
    {
      "topics": [
        "gen ai is reshaping customer journeys",
        "mckinsey purchasing funnel"
      ],
      "content": "\n\n==================================================\n## Topic: Gen Ai Is Reshaping Customer Journeys\n(Source slides: 5)\n\n### Content\nGen AI is reshaping customer journeys\n\nIllustrative\n\nhttps://www.bcg.com/publications/2024/three-ways-genai-will-transform-customer-experience\nhttps://www.bain.com/insights/generative-ai-potential-to-improve-customer-experience/\nhttps://onlinelibrary.wiley.com/doi/10.1002/mar.70036\n\nSource: BCG analysis.\n\n### Key Concepts: Generative AI (Gen AI), Customer Journey, Personalized Advertising, Augmented Reality, Interactive Assistant, Cost to Serve, Customer Loyalty, Cross-sell, Up-sell\n\n### Examples\n- Receiving personalized advertising with AI-generated content.\n- Using an interactive assistant to browse a catalog.\n- Using GenAI and augmented reality to demonstrate products in a physical space.\n- Using auto-generated user guides and tutorials after purchase.\n- A call center agent using AI dynamic scripts to troubleshoot a query.\n- An agent receiving next-best-action prompts for cross-selling during a call.\n\n### Visual Elements\n- [flowchart] A diagram showing two customer journey flows and how Gen AI can impact them. The top flow represents the purchase journey (Discovery -> Research -> Comparison -> Purchase decision -> Payment -> Delivery). The bottom flow represents the post-purchase journey (Setup -> Use -> Issue resolution -> Reconsideration). Callout boxes link specific Gen AI applications to business outcomes at various stages. For example, 'I receive personalized advertising with AI-generated content and images' leads to 'Improved click-through rate' at the Discovery stage. 'I talk to a call center agent who uses AI dynamic scripts to troubleshoot my query' leads to 'Reduced cost to serve' at the Issue resolution stage.\n  Key points: Gen AI can be applied across the entire customer journey, from discovery to post-purchase support., In the purchase phase, Gen AI can improve click-through rates, conversion, and brand awareness., In the post-purchase phase, Gen AI can lower returns, reduce service costs, and increase loyalty through better support and up-selling.\n\n==================================================\n## Topic: Mckinsey Purchasing Funnel\n(Source slides: 1, 2, 3, 4)\n\n### Content\nMcKinsey purchasing funnel\n• 5 steps purchasing funnel\n\n### Key Concepts: McKinsey purchasing funnel, Awareness, Familiarity, Consideration, Purchase, Loyalty, Online vs Offline channels, Solution Evaluation, Evaluation of the Purchasing Experience, Shopping Value, Value in use, Customer journey mapping, Brand consideration set, Brand choice, Camera market\n\n### Examples\n- A customer journey for purchasing a camera, starting with awareness of brands like Nikon, Sony, Canon, etc., and ending with the purchase of a Canon 5D MK4.\n- A customer journey for purchasing a camera, showing brands like Nikon, Sony, Canon, etc., and culminating in the purchase of a Canon product.\n\n### Visual Elements\n- [flowchart] A five-stage flowchart representing the McKinsey purchasing funnel. The stages are labeled from left to right: AWARENESS, FAMILIARITY, CONSIDERATION, PURCHASE, LOYALTY. Each stage is depicted with a group of circles, which decrease in number at each subsequent stage, symbolizing the narrowing of choices. \nStage 1 (AWARENESS): A grid of 24 circles (12 orange, 12 white outline).\nStage 2 (FAMILIARITY): A grid of 12 circles (6 orange, 6 white outline).\nStage 3 (CONSIDERATION): A grid of 6 circles (3 orange, 3 white outline).\nStage 4 (PURCHASE): A row of 3 circles (2 orange, 1 white outline).\nStage 5 (LOYALTY): Represented by a single sun-like icon, symbolizing the final choice and brand loyalty.\n  Key points: The funnel illustrates a progressive reduction of options., The process starts with broad awareness of many options., It narrows down to familiarity with a smaller set., Further narrowing occurs during the consideration phase., A purchase decision is made from a very small set of options., The final stage is achieving customer loyalty.\n- [diagram] A detailed diagram of the 5-step purchasing funnel, showing specific marketing channels and customer activities within each stage. The funnel is divided horizontally into 'ONLINE' and 'OFFLINE' sections. The entire process is bracketed by 'Solution Evaluation' at the top and 'Evaluation of the Purchasing Experience' and 'Shopping Value' at the bottom. The funnel begins with a shopping cart icon and ends with an icon of a person holding a shopping bag, labeled 'Value in use'.\n\n- **AWARENESS:**\n  - ONLINE: SEO, e-targeting, Social media, Banners, Mobile Marketing, SEA, Blog, Website, Youtube\n  - OFFLINE: Cinema, Radio, Press, Billboard, Mailing, Catalog, TV, POS, Sponsoring, Display\n\n- **FAMILIARITY:**\n  - ONLINE: SEO, Consumer opinion, Social media, Rankings, Mobile Marketing, Newsletter, Website, Blog, Youtube\n  - OFFLINE: Recommendations, Press, Radio, Billboard, Word of Mouth, Catalog, Cinema, POS, Display\n\n- **CONSIDERATION:**\n  - ONLINE: e-Mailing, Consumer opinion, Website, Newsletter, Blog, Youtube\n  - OFFLINE: Recommendations, Press, TV, Offers, Location, Coupons, Word of Mouth, Catalog, Cinema\n\n- **PURCHASE:**\n  - ONLINE: POS, e-mail Conversation, Checkout\n  - OFFLINE: Cash register ticket, Chat, Receipt\n\n- **LOYALTY:**\n  - ONLINE: Newsletter, Social media\n  - OFFLINE: Loyalty card, Mailing\n  Key points: The funnel maps specific online and offline marketing tactics to each stage of the customer journey., The customer journey involves both 'Solution Evaluation' and 'Evaluation of the Purchasing Experience'., The goal is to provide 'Shopping Value' and achieve 'Value in use' for the customer., Different channels are effective at different stages of the funnel.\n- [diagram] An example application of the McKinsey purchasing funnel for buying a camera. The diagram structure is the same as the previous slide, with ONLINE/OFFLINE channels and the five stages. It shows the narrowing of camera brands considered by a consumer throughout the journey. It starts with an icon of a person with a camera pushing a shopping cart, which contains a camera icon. It ends with an icon of a person holding a camera and a shopping bag, with the final product 'CANON 5D MK4' specified.\n\n- **AWARENESS:**\n  - ONLINE: Google, Facebook, 500px, ADS, Youtube, Blog, Website\n  - OFFLINE: Cinema, Billboard, Press, FNAC, Friends\n  - Brands considered: NIKON, OLYMPUS, PENTAX, SONY, CANON, PANASONIC\n\n- **FAMILIARITY:**\n  - ONLINE: SEO, Consumer opinion, Social media, Rankings, Mobile Marketing, Newsletter, Website, Blog, Youtube\n  - OFFLINE: Recommendations, Press, Radio, Billboard, Mailing, Catalog, Cinema, POS, Display\n  - Brands considered: PENTAX, SONY, CANON, NIKON, OLYMPUS\n\n- **CONSIDERATION:**\n  - ONLINE: e-Mailing, Consumer opinion, Website, Newsletter, Blog, Youtube\n  - OFFLINE: Recommendations, Press, TV, Offers, Location, Coupons, Word of Mouth, Catalog, Cinema\n  - Brands considered: SONY, CANON, NIKON\n\n- **PURCHASE:**\n  - ONLINE: POS, e-mail Confirmation, Checkout\n  - OFFLINE: Cash register ticket, Receipt\n  - Brand purchased: CANON\n\n- **LOYALTY:**\n  - ONLINE: Newsletter, Social media\n  - OFFLINE: Loyalty card, Mailing\n  - Loyal product: CANON 5D MK4\n  Key points: Illustrates how a broad set of camera brands (Nikon, Olympus, Pentax, Sony, Canon, Panasonic) is narrowed down., The consumer moves from awareness of 6 brands to considering 3 brands (Sony, Canon, Nikon)., The final purchase is a Canon camera., Loyalty is demonstrated by identifying with a specific high-end model, the Canon 5D MK4.\n- [diagram] An example application of the McKinsey purchasing funnel for buying a camera, nearly identical to the previous slide but without the illustrative icons and the specific final product model. The diagram structure shows ONLINE/OFFLINE channels and the five stages, illustrating the narrowing of camera brands considered by a consumer.\n\n- **AWARENESS:**\n  - ONLINE: Google, Facebook, 500px, ADS, Youtube, Blog, Website\n  - OFFLINE: Cinema, Billboard, Press, FNAC, Friends\n  - Brands considered: NIKON, OLYMPUS, PENTAX, SONY, CANON, PANASONIC\n\n- **FAMILIARITY:**\n  - ONLINE: SEO, Consumer opinion, Social media, Rankings, Mobile Marketing, Newsletter, Website, Blog, Youtube\n  - OFFLINE: Recommendations, Press, Radio, Billboard, Mailing, Catalog, Cinema, POS, Display\n  - Brands considered: PENTAX, SONY, CANON, NIKON, OLYMPUS\n\n- **CONSIDERATION:**\n  - ONLINE: e-Mailing, Consumer opinion, Website, Newsletter, Blog, Youtube\n  - OFFLINE: Recommendations, Press, TV, Offers, Location, Coupons, Word of Mouth, Catalog, Cinema\n  - Brands considered: SONY, CANON, NIKON\n\n- **PURCHASE:**\n  - ONLINE: POS, e-mail Confirmation, Checkout\n  - OFFLINE: Cash register ticket, Receipt\n  - Brand purchased: CANON\n\n- **LOYALTY:**\n  - ONLINE: Newsletter, Social media\n  - OFFLINE: Loyalty card, Mailing\n  Key points: Illustrates the narrowing of a brand consideration set for cameras, from 6 initial brands down to 1 purchased brand., The consumer journey progresses through awareness, familiarity, and consideration stages., The final purchase decision is for the 'CANON' brand., Unlike the previous slide, this version is more generic, lacking the specific icons and final product model (5D MK4).",
      "key_concepts": [
        "Generative AI (Gen AI)",
        "Customer Journey",
        "Personalized Advertising",
        "Augmented Reality",
        "Interactive Assistant",
        "Cost to Serve",
        "Customer Loyalty",
        "Cross-sell",
        "Up-sell",
        "McKinsey purchasing funnel",
        "Awareness",
        "Familiarity",
        "Consideration",
        "Purchase",
        "Loyalty"
      ],
      "educational_value": 0.9
    },
    {
      "topics": [
        "never stop daring",
        "le wagon first sessions"
      ],
      "content": "\n\n==================================================\n## Topic: Never Stop Daring\n(Source slides: 1)\n\n### Content\nAudencia\naudencia.com\n\nNEVER STOP DARING\n\n\"\nCultiver l'audace, toujours et à tout âge,\ncroire en soi, se lancer, innover,\napprendre de ses échecs,\nse relever et recommencer.\nS'engager avec et pour les autres,\nagir en manager responsable,\nrespectueux et bienveillant,\nimpacter positivement la société.\n\nL'audace nous grandit,\nélargit notre horizon,\nnourrit notre imagination\npour mieux transformer le monde.\n\"\n\n### Definitions\n- **L'audace (Audacity)**: According to the slide, audacity is a quality to be cultivated at all ages. It involves believing in oneself, launching initiatives, innovating, learning from failures, recovering and starting again. It also entails engaging with and for others, acting as a responsible, respectful, and caring manager, and positively impacting society. It is presented as a force for personal growth, broadening horizons, and fueling imagination to transform the world.\n\n### Key Concepts: Audacity (L'audace), Innovation, Resilience, Responsible Management, Societal Impact, Lifelong Learning, Branding\n\n==================================================\n## Topic: Le Wagon First Sessions\n(Source slides: 5)\n\n### Content\n• How it works\n• Make sure you received an e-mail explaining how to access the platform\n• Check the video on BlackBoard that explains how to approach these 2 online sessions\n• Before next off-line session (in 2 weeks), you MUST go through the following contents on LeWagon :\n  • Introduction\n  • Using Designer Tools\n  • Product Pitch\n  • UX Personas\n  • User Journeys\n  • User flow\n\n### Key Concepts: Le Wagon, BlackBoard, Online Sessions, Designer Tools, Product Pitch, UX Personas, User Journeys, User flow\n\n### Examples\n- The list of contents to complete on LeWagon: Introduction, Using Designer Tools, Product Pitch, UX Personas, User Journeys, User flow.\n\n### Visual Elements\n- [screenshot] A screenshot of the Le Wagon online learning platform interface is shown on the right side of the slide. It displays a course curriculum with sections like 'Product Design', 'Product Pitch', and 'UX Deep Dive'. Specific modules listed include 'WELCOME, WAGON', 'WIREFRAMING', 'BRANDING & UI', and 'UI KITS'. A red box highlights a video thumbnail titled 'Le Wagon Video Presentation'.\n  Key points: The screenshot provides a visual guide to the Le Wagon platform., It shows the structure of the course content students need to navigate., A specific video presentation is highlighted as an important resource.",
      "key_concepts": [
        "Audacity (L'audace)",
        "Innovation",
        "Resilience",
        "Responsible Management",
        "Societal Impact",
        "Lifelong Learning",
        "Branding",
        "Le Wagon",
        "BlackBoard",
        "Online Sessions",
        "Designer Tools",
        "Product Pitch",
        "UX Personas",
        "User Journeys",
        "User flow"
      ],
      "educational_value": 0.65
    }
  ],
  "full_result": {
    "lecture_title": "Session 3 - Framework for customer experience.pdf",
    "total_original_slides": 41,
    "educational_slides_count": 34,
    "filtered_slides_count": 7,
    "topic_count": 6,
    "topics": [
      {
        "name": "the customer journey",
        "slides": [
          1,
          1,
          1,
          2,
          2,
          2,
          2,
          3,
          3,
          3,
          3,
          4,
          4,
          4,
          4,
          5,
          5,
          5,
          5
        ],
        "main_text": "• Pre purchase, purchase and post purchase stages\n\nPurchase Stage:\nThis stage encompasses all customer interactions with the brand during the purchase. It includes behaviors such as choice, ordering, and payment. It is considered as the most “temporally compressed” of the three stages.\n\nThe Customer Journey\n\n- Types of Touch Points\n\nPartner-owned touch points:\n\nThese touch points are jointly designed, controlled and managed by the firm and its partner(s). The partners could be multivendor partners, multichannel distributors partners, communication partners, etc.\n\nThe Customer Journey\n\n- Types of Touch Points\n\nSocial/external touch points:\n\nThese touch points are all external people that may influence the customer experience. It may concerns the advices of customers (e.g. Comments on TripAdvisor) or peer influences, independent information sources, etc. Sometimes influencers may be independent and sometimes they are in line with firm expectations. Lemon & Verhoef (2016)\n\nIt includes the use/consumption of the product/service, and service requests. It is an important phase where the customer will evaluate his shopping experience. Based on this evaluation, he will engage or not with the brand, become loyal or not, use negative or positive W.O.M’s.\n\n• Today's exercise\n\nCustomer activities\n(what is the customer doing?)\n\nExperience (what is the customer's feeling : positive, negative, neutral; High versus Low)\n\nTouchpoints\n\n• Types of Touch Points\n\nBrand-owned touch points:\nThese touch points customer interactions are designed, controlled and managed by the firm. It may concern the marketing mix (products, price strategy, service, distribution) and more broadly the brand owned media such as advertising, websites, loyalty programs, etc.\n\nThe Customer Journey Map\n\n- What are the steps in a customer journey? Customer activities\n(what is the customer doing?)\n\nExperience (what is the customer's feeling : positive, negative, neutral; High versus Low)\n\nTouchpoints\n\n• Example Nike\n\nhttps://www.questionpro.com/blog/nike-customer-experience/\n\nThe Customer Journey\n\nOverview of the Customer Journey\n\nFeedback\n\nPREVIOUS EXPERIENCE (t-n)\nPrepurchase Stage\nPurchase Stage\nPostpurchase Stage\n\nCURRENT EXPERIENCE (t)\nPre purchase Stage\nTouchpoints: Brand owned, partner owned, customer owned, social/external\nBehaviors: need recognition, consideration, search\n\nPurchase Stage\nTouchpoints: Brand owned, partner owned, customer owned, social/external\nBehaviors: choice, ordering, payment\n\nPost purchase Stage\nTouchpoints: Brand owned, partner owned, customer owned, social/external\nBehaviors: consumption, usage, engagement, service requests\n\nFUTURE EXPERIENCE (t+n)\nPrepurchase Stage\nPurchase Stage\nPostpurchase Stage\n\nCustomer Journey\n\nExtracted from Lemon & Verhoef (2016, p. 77)\n\nThe Customer Journey\n\n- Types of Touch Points\n\nCustomer-owned touch points:\n\nThese touch points concerned all customer actions that are part of the customer experience. The company, its partners or others do not influence or control these actions. These actions may include customers reflecting on their needs and desires and the transformation of a company product into a use not intended by the firm.\n\nThe Customer Journey Map\n\n- Example\n\nhttps://miro.com/miroverse/fly-ux-customer-journey-map/\n\nFly UX - Customer Journey Map\n\nFly UX Customer Journey Map by Eva Huse Pedersen\nMiro.com\n\nThe Customer Journey\n\nPre purchase, purchase and post purchase stages\n\nPre purchase Stage:\nThis stage encompasses all direct or indirect customer interactions with the brand before the purchase. It generally starts with the “need/goal/impulse recognition to consideration of satisfying that need/goal/impulse with a purchase” including the search stage (Lemon & Verhoef, 2016, p.76).\n\nNike Customer Journey\n\n• Today's exercise\n\n• Groups of 2\n\n• Create a persona corresponding to a segment of the Nike brand. • Map the customer journey of this persona to buy Nike sneakers online\n\n• Be ready to present in front of everyone 🙂",
        "key_concepts": [
          "Customer Journey",
          "Purchase Stage",
          "Pre purchase",
          "Post purchase",
          "Touchpoints",
          "Behaviors",
          "Temporally compressed",
          "Touch Points",
          "Partner-owned touch points",
          "Social/external touch points",
          "Customer Experience",
          "Peer Influence",
          "Influencers",
          "Post purchase Stage",
          "Customer Evaluation",
          "Brand Loyalty",
          "Word-of-Mouth (W.O.M.)",
          "Consumption",
          "Service Requests",
          "E-commerce",
          "Multichannel distributor",
          "Influencer Marketing",
          "Social Media",
          "Product Reviews",
          "Customer Journey Mapping",
          "Prepurchase",
          "Purchase",
          "Postpurchase",
          "Customer Activities",
          "Brand-owned touch points",
          "Marketing Mix",
          "Brand owned media",
          "Sponsorship",
          "Communication partner",
          "Customer Journey Map",
          "Customer Journey Stages",
          "Awareness",
          "Consideration",
          "Decision",
          "Service",
          "Loyalty",
          "Touchpoint",
          "Customer Actions",
          "Experience",
          "Pain Points",
          "Potential Solution",
          "Customer Journey Overview",
          "Previous Experience",
          "Current Experience",
          "Future Experience",
          "Pre-purchase Stage",
          "Post-purchase Stage",
          "Customer Behaviors",
          "Feedback Loop",
          "Brand Touchpoints",
          "Pre-purchase",
          "Post-purchase",
          "Customer-owned touch points",
          "Unintended product use",
          "User Experience (UX)",
          "Customer Goals",
          "Customer Behaviours",
          "Journey Stages",
          "Customer Interactions",
          "Need Recognition",
          "Search Stage",
          "Website",
          "Advertising",
          "Product Customization",
          "User-generated content",
          "Product modification",
          "IKEA Hacking",
          "Persona Application",
          "Brand Segmentation",
          "Group Exercise",
          "Presentation"
        ],
        "definitions": [
          {
            "term": "Purchase Stage",
            "definition": "This stage encompasses all customer interactions with the brand during the purchase. It includes behaviors such as choice, ordering, and payment. It is considered as the most “temporally compressed” of the three stages."
          },
          {
            "term": "Partner-owned touch points",
            "definition": "These touch points are jointly designed, controlled and managed by the firm and its partner(s). The partners could be multivendor partners, multichannel distributors partners, communication partners, etc."
          },
          {
            "term": "Social/external touch points",
            "definition": "These touch points are all external people that may influence the customer experience. It may concerns the advices of customers (e.g. Comments on TripAdvisor) or peer influences, independent information sources, etc. Sometimes influencers may be independent and sometimes they are in line with firm expectations."
          },
          {
            "term": "Post purchase Stage",
            "definition": "The last stage concerns all interactions with the brand and its environment after purchase. It includes the use/consumption of the product/service, and service requests. It is an important phase where the customer will evaluate his shopping experience. Based on this evaluation, he will engage or not with the brand, become loyal or not, use negative or positive W.O.M’s."
          },
          {
            "term": "Brand-owned touch points",
            "definition": "These touch points customer interactions are designed, controlled and managed by the firm. It may concern the marketing mix (products, price strategy, service, distribution) and more broadly the brand owned media such as advertising, websites, loyalty programs, etc."
          },
          {
            "term": "Customer-owned touch points",
            "definition": "These touch points concerned all customer actions that are part of the customer experience. The company, its partners or others do not influence or control these actions. These actions may include customers reflecting on their needs and desires and the transformation of a company product into a use not intended by the firm."
          },
          {
            "term": "Pre purchase Stage",
            "definition": "This stage encompasses all direct or indirect customer interactions with the brand before the purchase. It generally starts with the “need/goal/impulse recognition to consideration of satisfying that need/goal/impulse with a purchase” including the search stage (Lemon & Verhoef, 2016, p.76)."
          }
        ],
        "examples": [
          "multivendor partners",
          "multichannel distributors partners",
          "communication partners",
          "Comments on TripAdvisor",
          "The 'wethenew' website selling Air Jordan sneakers is an example of a partner-owned touch point, specifically a multichannel distributor.",
          "A screenshot of a YouTube video titled 'Air Jordan 1 Mid Chicago Black Toe REVIEW and ON-FEET!', showing a product review which is a form of external touchpoint.",
          "A screenshot of an Instagram post from the influencer 'xsqueezie' announcing a collaboration with Nike. The caption (in French) discusses a new fitness program in partnership with Nike, illustrating an influencer acting as an external touchpoint in line with firm expectations.",
          "Gillette",
          "Mitsubishi",
          "Coca-Cola",
          "IBM",
          "Walt Disney",
          "MasterCard",
          "Nescafé",
          "Visa",
          "BIC",
          "Philips",
          "Ford",
          "FedEx",
          "Esso",
          "Vodafone",
          "Pampers",
          "IKEA",
          "Intel",
          "Microsoft",
          "Bosch",
          "Durex",
          "Heineken",
          "Adobe",
          "Red Bull",
          "Samsung",
          "A sponsored sports team (like the French national football team) is an example of a partner-owned touch point, representing a communication partnership.",
          "The entire slide is a detailed example of a Customer Journey Map for the brand Nike.",
          "Customers reflecting on their needs and desires.",
          "The transformation of a company product into a use not intended by the firm.",
          "The entire 'Fly UX - Customer Journey Map' is an example. Specific pain points mentioned include communication issues, confusing options, language barriers on the website, and lack of clarity on fare inclusions.",
          "Nike's e-commerce website",
          "Nike's print/digital advertising",
          "Nike's product customization service ('Nike By You')",
          "The 'IKEA hackers' website, where customers share modifications to IKEA products, is an example of a customer-owned touch point.",
          "The exercise itself is an example: creating a persona for a Nike brand segment and mapping their journey to buy sneakers online."
        ],
        "diagrams": [
          {
            "type": "flowchart",
            "key_points": [
              "Prepurchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: need recognition, consideration, search.",
              "Purchase Stage (Yellow Highlighted Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: choice, ordering, payment.",
              "Postpurchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: consumption, usage, engagement, service requests."
            ],
            "description": "A flowchart diagram illustrates the three stages of the customer journey as three sequential, overlapping chevrons pointing from left to right. The first stage is 'Prepurchase Stage' in blue. The middle stage, 'Purchase Stage', is highlighted in yellow. The final stage is 'Postpurchase Stage' in blue. Each chevron contains information about its respective touchpoints and behaviors."
          },
          {
            "type": "flowchart",
            "key_points": [
              "Prepurchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: need recognition, consideration, search.",
              "Purchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: choice, ordering, payment.",
              "Postpurchase Stage (Yellow Highlighted Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: consumption, usage, engagement, service requests."
            ],
            "description": "A flowchart diagram illustrates the three stages of the customer journey as three sequential, overlapping chevrons pointing from left to right. The first stage is 'Prepurchase Stage' in blue. The middle stage is 'Purchase Stage' in blue. The final stage, 'Postpurchase Stage', is highlighted in yellow. Each chevron contains information about its respective touchpoints and behaviors."
          },
          {
            "type": "screenshot",
            "key_points": [
              "Product: Air Jordan 1 Mid Chicago Black Toe",
              "Retailer: wethenew",
              "Price: €280.00",
              "Features: Installment payments, loyalty program, express delivery."
            ],
            "description": "A screenshot of a product page from the e-commerce website 'wethenew'. The page displays the 'Air Jordan 1 Mid Chicago Black Toe' sneaker. Key elements shown are the product image, product name, price (€280.00), installment payment options (2x, 3x, 4x), loyalty points (+280 points de fidélité), size selection (TAILLE), a guide to sizes (GUIDE DES TAILLES), an 'Add to cart' button (Ajouter au panier), and delivery information (48H Livraison). The top navigation includes a search bar, user account, wishlist, and cart icons."
          },
          {
            "type": "flowchart and table",
            "key_points": [
              "The customer journey is divided into three main phases: Prepurchase, Purchase, and Postpurchase.",
              "The journey is further broken down into 6 specific steps.",
              "The map tracks three key aspects at each step: Customer activities, Experience/Feelings, and Touchpoints."
            ],
            "description": "The slide presents a template for a customer journey map. At the top, a flowchart shows three main phases: 'Prepurchase', 'Purchase', and 'Postpurchase', connected by arrows. Below this, a red bar is divided into six sequential steps: 'Step 1' through 'Step 6'. The main body is a table with three rows labeled: 'Customer activities (what is the customer doing?)', 'Experience (what is the customer's feeling : positive, negative, neutral; High versus Low)', and 'Touchpoints'. The table columns correspond to the six steps and are currently empty, intended for an exercise."
          },
          {
            "type": "image collage",
            "key_points": [],
            "description": "A collage of numerous well-known brand logos, serving as examples of brands that manage their own touch points."
          },
          {
            "type": "framework/table",
            "key_points": [
              "The customer journey is divided into Prepurchase, Purchase, and Postpurchase stages.",
              "Each stage consists of multiple steps.",
              "For each step, the map analyzes customer activities, their emotional experience, and the touchpoints they interact with."
            ],
            "description": "A template for a customer journey map. It has a timeline at the top divided into three main stages: Prepurchase, Purchase, and Postpurchase. Below this, the timeline is marked with six steps (Step 1 to Step 6). Step 1, 2, 3 are under Prepurchase; Step 4 is under Purchase; Step 5, 6 are under Postpurchase. The rows below are categories for analysis at each step: 'Customer activities (what is the customer doing?)', 'Experience (what is the customer's feeling : positive, negative, neutral; High versus Low)', and 'Touchpoints'."
          },
          {
            "type": "table/matrix",
            "key_points": [
              "Awareness Stage: Touchpoint is Nike.com; customer feels interested but hesitant due to difficulty finding items.",
              "Consideration Stage: Touchpoint is Product Pages; customer is curious but faces uncertainty about product features.",
              "Decision Stage: Touchpoint is Online Shopping; customer is excited but faces a lengthy checkout process.",
              "Service Stage: Touchpoint is Returns and Exchanges; customer is frustrated due to complicated return processes.",
              "Loyalty Stage: Touchpoint is Exclusive Drops; customer is satisfied and happy but has limited opportunities for early access."
            ],
            "description": "A detailed customer journey map for the brand Nike, structured as a grid. The columns represent the five stages of the journey: Awareness, Consideration, Decision, Service, and Loyalty. The rows represent different aspects of the customer experience: TOUCHPOINT, Customer Actions, Experience, Pain Points, and Potential Solution. The 'Experience' row includes a line graph with emoticons (sad, neutral, happy, frustrated, very happy) plotting the emotional journey of the customer through the stages. Each cell in the grid contains specific information for Nike. For example, in the 'Awareness' stage, the touchpoint is 'Nike.com', the customer action is visiting the website, the pain point is 'Difficulty in finding desired items', and the potential solution is to 'Enhance website navigation and search functionality'."
          },
          {
            "type": "flowchart",
            "key_points": [
              "The customer journey is a process over time, influenced by past experiences and shaping future ones.",
              "The current experience is comprised of pre-purchase, purchase, and post-purchase stages.",
              "Each stage involves various touchpoints (brand, partner, customer, and social/external owned).",
              "Each stage is characterized by specific customer behaviors.",
              "There is a feedback mechanism where the current experience informs future 'previous experiences'."
            ],
            "description": "A flowchart illustrating the Customer Journey over time. It is divided into three main columns: 'PREVIOUS EXPERIENCE (t-n)', 'CURRENT EXPERIENCE (t)', and 'FUTURE EXPERIENCE (t+n)'. A large yellow arrow labeled 'Customer Journey' flows from left to right underneath these columns. The 'CURRENT EXPERIENCE' column is further subdivided into three sequential stages: 'Pre purchase Stage' (green), 'Purchase Stage' (yellow), and 'Post purchase Stage' (orange). Each of these stages lists associated 'Touchpoints' and 'Behaviors'. Specifically:\n- Pre purchase Stage: Touchpoints include Brand owned, partner owned, customer owned, social/external. Behaviors include need recognition, consideration, search.\n- Purchase Stage: Touchpoints include Brand owned, partner owned, customer owned, social/external. Behaviors include choice, ordering, payment.\n- Post purchase Stage: Touchpoints include Brand owned, partner owned, customer owned, social/external. Behaviors include consumption, usage, engagement, service requests.\nA 'Feedback' loop is shown with arrows pointing from the Current Experience stages back to influence the Previous Experience."
          },
          {
            "type": "concept map",
            "key_points": [
              "PRE-PURCHASE Touchpoints: SOCIAL MEDIA, ADS, MARKETING, DISPLAYS, PROMOS, EMAIL, DIRECT MAIL, PR, WORD OF MOUTH.",
              "PURCHASE Touchpoints: SALES PERSON, UP SALE, PACKAGING, ECOMMERCE, WEB, STORE OR OFFICE, CATALOGUE.",
              "POST-PURCHASE Touchpoints: INVOICE, EVENTS, SURVEYS, CUSTOMER SERVICE, BILLING, FORUMS, SOCIAL MEDIA, NEWS LETTER, LOYALTY PROGRAM, BRAND PROMISE."
            ],
            "description": "A diagram titled 'BRAND TOUCHPOINTS' which maps various touchpoints to the three customer journey stages. The stages (PRE-PURCHASE, PURCHASE, POST-PURCHASE) are listed at the bottom. An overarching orange arrow labeled 'CUSTOMER EXPERIENCE' spans the top. Touchpoints are represented as colored circles (blue and orange) and are grouped under their relevant stage."
          },
          {
            "type": "table/chart",
            "key_points": [
              "The map provides a step-by-step analysis of a customer's interaction with a service.",
              "It tracks customer goals, behaviors, and pain points at each stage.",
              "Identifying pain points is crucial for improving the overall customer experience."
            ],
            "description": "An example of a detailed Customer Journey Map for a fictional airline, 'Fly UX'. The map is a grid with columns representing stages of the journey and rows representing different aspects of the customer experience. \n- Stages (Columns): Awareness, Consideration, Booking Page - Search flight, Flight Search Result, Select Fare. \n- Aspects (Rows): Goals, Behaviours, Connect, Pain Points. \nEach cell contains bullet points detailing the customer's experience at that stage. For example, under 'Consideration', a 'Pain Point' is 'The options are changing very quickly and that makes it confusing'. Under 'Select Fare', a 'Goal' is 'I want to understand what value I get for the price' and a 'Pain Point' is 'I am not sure what is included in the fare'."
          },
          {
            "type": "diagram",
            "key_points": [
              "The Pre-purchase stage is the first phase of the customer journey.",
              "It involves specific touchpoints and behaviors like need recognition and search."
            ],
            "description": "A simplified visual representation of the customer journey stages, shown as three connected chevrons pointing from left to right. The first chevron is green and labeled 'Prepurchase Stage', listing 'Touchpoints: Brand owned, partner owned, customer owned, social/external' and 'Behaviors: need recognition, consideration, search'. The subsequent chevrons for 'Purchase Stage' and 'Postpurchase Stage' are shaded in blue and contain similar labels for touchpoints and behaviors, though the text is less prominent. The Pre-purchase stage is visually highlighted."
          },
          {
            "type": "image examples",
            "key_points": [
              "Example 1: Nike website with a '30% OFF EVERYTHING' promotion.",
              "Example 2: Nike 'Just do it.' advertisement with the tagline 'It's only a crazy dream until you do it.'",
              "Example 3: Nike 'By You' product customization tool, labeled in French 'Chaussures Personnalisées Nike By You'."
            ],
            "description": "The slide displays three visual examples of Nike's brand-owned touch points. 1) Top-left: A screenshot of the Nike e-commerce website, showing a promotional banner for '30% OFF EVERYTHING'. 2) Bottom-left: A Nike advertisement with a young girl running, featuring the slogan 'It's only a crazy dream until you do it. Just do it.'. 3) Right: A screenshot of the Nike 'By You' product customization page, showing a personalized shoe and the text 'Chaussures Personnalisées Nike By You'."
          },
          {
            "type": "screenshot",
            "key_points": [
              "Website: IKEA hackers",
              "Concept: Modifying and customizing IKEA products.",
              "Functionality: Showcasing ideas, categories, and allowing users to submit hacks.",
              "Example of: Transformation of a product for unintended uses, a customer-owned touch point."
            ],
            "description": "A screenshot of the 'IKEA hackers' website homepage. The logo is a stylized version of the IKEA logo. The main navigation includes HACKS, IDEAS, BEST OF, START HERE, SUBMIT HACK, and SHOP. The main heading is 'HACKS'. The text describes how to transform, upcycle, and customize IKEA furniture. It mentions specific examples like adding legs to a KALLAX shelf or creating LEGO storage. Below this is a section titled 'Popular Ikea Hacking Categories' with image links to 'Living Room', 'Dining', 'Dividers', and 'Desks'."
          },
          {
            "type": "icon",
            "key_points": [],
            "description": "An icon in the bottom right corner shows a message/chat interface with a large red circle containing a white clock symbol overlaid on top of it, suggesting a timed activity or presentation."
          }
        ],
        "formulas": [],
        "notes": "Reference: Lemon & Verhoef (2016). Slide number in the bottom right corner is 6. Logos at the bottom include Audencia, EQUIS, AACSB, AMBA, CEFDG, CONFERENCE DES GRANDES ECOLES, and Coalition. Slide number 11. Source citation: Lemon & Verhoef (2016). Slide number 16. Cites 'Lemon & Verhoef (2016)' as a source. Reference: (2016). Slide number in the bottom right corner is 7. Slide number 12. This slide provides a visual example of a partner-owned touch point discussed in the previous slide. Slide number 17. This slide provides visual examples for the concept of social/external touch points discussed in the previous slide. This slide provides the framework or template for the 'Today's exercise' on mapping a customer journey. The slide number is 37. Reference: Lemon & Verhoef (2016). Slide number in the bottom right corner is 8. Slide number 13. This slide provides another visual example of a partner-owned touch point. Slide number 18. This slide presents a generic framework for creating a customer journey map. The slide provides a complete, practical example of a customer journey map, illustrating how to fill out the template from the previous slide. A source URL is provided. The slide number is 38. The model is attributed to Lemon & Verhoef (2016, p. 77). Slide number in the bottom right corner is 9. Slide number 14. Source citation: Lemon & Verhoef (2016). Slide number 19. The source of the example is Miroverse, created by Eva Huse Pedersen. The definition provided is sourced from Lemon & Verhoef (2016). Slide number in the bottom right corner is 10. Slide number 15. This slide provides a visual example of a customer-owned touch point, as defined in the previous slide. This slide outlines a practical, in-class group exercise. It requires students to apply the concepts of persona creation and customer journey mapping to a real-world brand, Nike. The final step is a presentation.",
        "educational_value": 1.0
      },
      {
        "name": "mckinsey purchasing funnel",
        "slides": [
          1,
          2,
          3,
          4
        ],
        "main_text": "McKinsey purchasing funnel\n• 5 steps purchasing funnel",
        "key_concepts": [
          "McKinsey purchasing funnel",
          "Awareness",
          "Familiarity",
          "Consideration",
          "Purchase",
          "Loyalty",
          "Online vs Offline channels",
          "Solution Evaluation",
          "Evaluation of the Purchasing Experience",
          "Shopping Value",
          "Value in use",
          "Customer journey mapping",
          "Brand consideration set",
          "Brand choice",
          "Camera market"
        ],
        "definitions": [],
        "examples": [
          "A customer journey for purchasing a camera, starting with awareness of brands like Nikon, Sony, Canon, etc., and ending with the purchase of a Canon 5D MK4.",
          "A customer journey for purchasing a camera, showing brands like Nikon, Sony, Canon, etc., and culminating in the purchase of a Canon product."
        ],
        "diagrams": [
          {
            "type": "flowchart",
            "key_points": [
              "The funnel illustrates a progressive reduction of options.",
              "The process starts with broad awareness of many options.",
              "It narrows down to familiarity with a smaller set.",
              "Further narrowing occurs during the consideration phase.",
              "A purchase decision is made from a very small set of options.",
              "The final stage is achieving customer loyalty."
            ],
            "description": "A five-stage flowchart representing the McKinsey purchasing funnel. The stages are labeled from left to right: AWARENESS, FAMILIARITY, CONSIDERATION, PURCHASE, LOYALTY. Each stage is depicted with a group of circles, which decrease in number at each subsequent stage, symbolizing the narrowing of choices. \nStage 1 (AWARENESS): A grid of 24 circles (12 orange, 12 white outline).\nStage 2 (FAMILIARITY): A grid of 12 circles (6 orange, 6 white outline).\nStage 3 (CONSIDERATION): A grid of 6 circles (3 orange, 3 white outline).\nStage 4 (PURCHASE): A row of 3 circles (2 orange, 1 white outline).\nStage 5 (LOYALTY): Represented by a single sun-like icon, symbolizing the final choice and brand loyalty."
          },
          {
            "type": "diagram",
            "key_points": [
              "The funnel maps specific online and offline marketing tactics to each stage of the customer journey.",
              "The customer journey involves both 'Solution Evaluation' and 'Evaluation of the Purchasing Experience'.",
              "The goal is to provide 'Shopping Value' and achieve 'Value in use' for the customer.",
              "Different channels are effective at different stages of the funnel."
            ],
            "description": "A detailed diagram of the 5-step purchasing funnel, showing specific marketing channels and customer activities within each stage. The funnel is divided horizontally into 'ONLINE' and 'OFFLINE' sections. The entire process is bracketed by 'Solution Evaluation' at the top and 'Evaluation of the Purchasing Experience' and 'Shopping Value' at the bottom. The funnel begins with a shopping cart icon and ends with an icon of a person holding a shopping bag, labeled 'Value in use'.\n\n- **AWARENESS:**\n  - ONLINE: SEO, e-targeting, Social media, Banners, Mobile Marketing, SEA, Blog, Website, Youtube\n  - OFFLINE: Cinema, Radio, Press, Billboard, Mailing, Catalog, TV, POS, Sponsoring, Display\n\n- **FAMILIARITY:**\n  - ONLINE: SEO, Consumer opinion, Social media, Rankings, Mobile Marketing, Newsletter, Website, Blog, Youtube\n  - OFFLINE: Recommendations, Press, Radio, Billboard, Word of Mouth, Catalog, Cinema, POS, Display\n\n- **CONSIDERATION:**\n  - ONLINE: e-Mailing, Consumer opinion, Website, Newsletter, Blog, Youtube\n  - OFFLINE: Recommendations, Press, TV, Offers, Location, Coupons, Word of Mouth, Catalog, Cinema\n\n- **PURCHASE:**\n  - ONLINE: POS, e-mail Conversation, Checkout\n  - OFFLINE: Cash register ticket, Chat, Receipt\n\n- **LOYALTY:**\n  - ONLINE: Newsletter, Social media\n  - OFFLINE: Loyalty card, Mailing"
          },
          {
            "type": "diagram",
            "key_points": [
              "Illustrates how a broad set of camera brands (Nikon, Olympus, Pentax, Sony, Canon, Panasonic) is narrowed down.",
              "The consumer moves from awareness of 6 brands to considering 3 brands (Sony, Canon, Nikon).",
              "The final purchase is a Canon camera.",
              "Loyalty is demonstrated by identifying with a specific high-end model, the Canon 5D MK4."
            ],
            "description": "An example application of the McKinsey purchasing funnel for buying a camera. The diagram structure is the same as the previous slide, with ONLINE/OFFLINE channels and the five stages. It shows the narrowing of camera brands considered by a consumer throughout the journey. It starts with an icon of a person with a camera pushing a shopping cart, which contains a camera icon. It ends with an icon of a person holding a camera and a shopping bag, with the final product 'CANON 5D MK4' specified.\n\n- **AWARENESS:**\n  - ONLINE: Google, Facebook, 500px, ADS, Youtube, Blog, Website\n  - OFFLINE: Cinema, Billboard, Press, FNAC, Friends\n  - Brands considered: NIKON, OLYMPUS, PENTAX, SONY, CANON, PANASONIC\n\n- **FAMILIARITY:**\n  - ONLINE: SEO, Consumer opinion, Social media, Rankings, Mobile Marketing, Newsletter, Website, Blog, Youtube\n  - OFFLINE: Recommendations, Press, Radio, Billboard, Mailing, Catalog, Cinema, POS, Display\n  - Brands considered: PENTAX, SONY, CANON, NIKON, OLYMPUS\n\n- **CONSIDERATION:**\n  - ONLINE: e-Mailing, Consumer opinion, Website, Newsletter, Blog, Youtube\n  - OFFLINE: Recommendations, Press, TV, Offers, Location, Coupons, Word of Mouth, Catalog, Cinema\n  - Brands considered: SONY, CANON, NIKON\n\n- **PURCHASE:**\n  - ONLINE: POS, e-mail Confirmation, Checkout\n  - OFFLINE: Cash register ticket, Receipt\n  - Brand purchased: CANON\n\n- **LOYALTY:**\n  - ONLINE: Newsletter, Social media\n  - OFFLINE: Loyalty card, Mailing\n  - Loyal product: CANON 5D MK4"
          },
          {
            "type": "diagram",
            "key_points": [
              "Illustrates the narrowing of a brand consideration set for cameras, from 6 initial brands down to 1 purchased brand.",
              "The consumer journey progresses through awareness, familiarity, and consideration stages.",
              "The final purchase decision is for the 'CANON' brand.",
              "Unlike the previous slide, this version is more generic, lacking the specific icons and final product model (5D MK4)."
            ],
            "description": "An example application of the McKinsey purchasing funnel for buying a camera, nearly identical to the previous slide but without the illustrative icons and the specific final product model. The diagram structure shows ONLINE/OFFLINE channels and the five stages, illustrating the narrowing of camera brands considered by a consumer.\n\n- **AWARENESS:**\n  - ONLINE: Google, Facebook, 500px, ADS, Youtube, Blog, Website\n  - OFFLINE: Cinema, Billboard, Press, FNAC, Friends\n  - Brands considered: NIKON, OLYMPUS, PENTAX, SONY, CANON, PANASONIC\n\n- **FAMILIARITY:**\n  - ONLINE: SEO, Consumer opinion, Social media, Rankings, Mobile Marketing, Newsletter, Website, Blog, Youtube\n  - OFFLINE: Recommendations, Press, Radio, Billboard, Mailing, Catalog, Cinema, POS, Display\n  - Brands considered: PENTAX, SONY, CANON, NIKON, OLYMPUS\n\n- **CONSIDERATION:**\n  - ONLINE: e-Mailing, Consumer opinion, Website, Newsletter, Blog, Youtube\n  - OFFLINE: Recommendations, Press, TV, Offers, Location, Coupons, Word of Mouth, Catalog, Cinema\n  - Brands considered: SONY, CANON, NIKON\n\n- **PURCHASE:**\n  - ONLINE: POS, e-mail Confirmation, Checkout\n  - OFFLINE: Cash register ticket, Receipt\n  - Brand purchased: CANON\n\n- **LOYALTY:**\n  - ONLINE: Newsletter, Social media\n  - OFFLINE: Loyalty card, Mailing"
          }
        ],
        "formulas": [],
        "notes": "The slide presents a simplified, conceptual view of the 5-step purchasing funnel. The circles likely represent different brands or products available to the consumer. This slide provides a practical framework by listing specific channels and touchpoints for each stage of the purchasing funnel. This slide provides a concrete example of the purchasing funnel, making the abstract concepts from the previous slides more tangible. This slide is a slight variation of slide 23. The primary differences are the absence of the illustrative icons (person with camera, etc.) at the start and end of the funnel, and the omission of the specific '5D MK4' model in the loyalty stage.",
        "educational_value": 0.75
      },
      {
        "name": "the construction of personas",
        "slides": [
          1,
          1,
          2,
          2,
          3,
          3,
          4,
          5
        ],
        "main_text": "The construction of Personas\n\n• What is a Persona? [Embedded YouTube Video]\nPERSONAS\n- SHOPPER PERSONAS\n- BUYERS PERSONAS\n\nhttps://www.youtube.com/watch?v=AVs59ddkzuQ\n\nThe construction of Personas\n\n• How do we create them? WHAT? Name: Robert\n\nGOALS\nPrimary goal? Secondary goal? • Intellectual and cultural development\n• Sharing time and experience with her grandchildren\n\nEXPECTATIONS\nPrimary expectation? Secondary expectation? • Quality\n• Emotions\n• Comfort\n• Uniqueness, originality\n\nQUOTES\nAbout goals, expectations, etc. • \"Now I've achieved a successful career, I want to enjoy my life in sharing time with my family\". • \"I love authentic products whose originality, quality and passion for making them can be appreciated.\"\n\n(Kusinitz 2014)\n\nA persona is « a semi-fictional representation of your ideal customer based on market research and real data about your existing customers »\n\nLemon & Verhoef (2016, p.73)\n\nUSER PERSONA\nJane Doe\nABOUT\nJane is a UX Designer that works for a Fortune 500 company in Atlanta, GA. Ever since she was a child, she loved to make stuff on her own and show them to her parents, friends and classmates. Over the course of her childhood and throughout high school, she won numerous design prizes at various art contests both locally and in the United States and Canada. Due to her passion for design, she decided to pursue a Master's degree in Human-Computer Interaction and learn more about User Experience (UX) and how she can become a better designer. \"I design with all my heart, thinking about the users\"\nAGE 21\nJOB TITLE UX Designer\nSTATUS Single\nLOCATION Atlanta, GA\nPASSIONATE EMPATHETIC CURIOUS ADVENTUROUS\nFAVORITE BRANDS\n[Facebook, Spotify, Coca-Cola logos]\nGOALS\n• Become a designer who communicates well her ideas at any place\n• Easily explain her design ideas to other designers, researchers and engineers\nPAIN POINTS\n• There are too many tools that forces her to spend time learning them\n• Cannot rely on other people's opinion because they are highly subjective\n• Certain situations require different tools to communicate her thoughts\nNEEDS\n• Looking for a design tool that helps to cut down unnecessary time and effort\n• Receive feedback on her progress whenever needed before presentation\n\nDrew\nInfluencer\nABOUT\nAge 25-29\nSkill: Vlogger\nHigh tech proficiency\nEVENT ATTENDANCE ATTRIBUTES\nFrequent event goer (monthly). Tied to the city for work. Would travel nationally/internationally for an event. Tends to go to events with a few friends. MOTIVATIONS\nHis favorite thing is to find & share them with network, helping influence. Being the first to know about something and share it gives him a thrill. CORE NEEDS\nFinding events on social media and being able to find tickets easily. Knowing what the trending events that will sell out are. Also, being able to buy tickets last minute with the first to get tickets. PAIN POINTS\nFinding the time to attend events and staying on budget. 39% Total Universe D18+ (Event Goers)\n12 Events per month\n\nhttps://dribbble.com/shots/4152326-Free-Template-User-Persona-Black-White\nhttps://dribbble.com/shots/3338369-User-Personas-attachments/723326\n\nThe construction of Personas\n\n• Why using Personas? Buyer Personas allow companies :\n- To have a clear idea of their different customers through characters (to make alive their segments)\n- Easily adapt, personalize, communicate with each segment (e.g. messages)\n- Mapping the different customer journeys by segments\n\nLemon & Verhoef (2016, p.73)\n\nThe construction of Personas\n\n• Another link on Canva\n\n[Screenshot of Canva website]\n\nCanva\nAccueil\nEntreprise\nEnseignement\nRecherchez des milliers de m... Créer un design\n\nPersonnel\n\nModèles Canva\n\nTous les filtres\nCatégorie\n\n7,415 templates\n\n[Thumbnails of various User Persona templates]\n\nhttps://www.canva.com/templates/s/user-persona/\n\nThe construction of Personas\n\n• What do we need to create them? Buyer personas are created through:\n- Qualitative interviews\n- Surveys\n- Other research (e.g. consumption trends)\n- Data bases (internal or external)\n\n(Kusinitz 2014)\n\nWHO? Name: Robert\n\nBACKGROUND\nJob? Career path? Family? • Head of Marketing Department\n• Worked at the same company for 30 years; he was brand manager before\n• Married with 3 children (25, 29 and 32)\n\nDEMOGRAPHICS\nGender? Age? Income? Location? • Gender male\n• Age 55-60\n• Income: $220,000\n• Suburban, owner\n\nIDENTIFIERS\nPersonality? Behavior? Technology? Social media? • Calm, curious\n• Passionate person who takes a long time before buying a product\n• Try to disconnect from technology to enjoy real life (low use of smartphone and social media)\n• Read HBR and FT\n\n(Kusinitz 2014)",
        "key_concepts": [
          "Persona",
          "Shopper Persona",
          "Buyer Persona",
          "Persona Construction",
          "Goals",
          "Expectations",
          "Quotes",
          "Persona definition",
          "Semi-fictional representation",
          "Ideal customer",
          "Market research",
          "Customer data",
          "User Persona",
          "UX Designer",
          "Influencer",
          "Demographics",
          "Pain Points",
          "Needs",
          "Motivations",
          "Personality Traits",
          "Customer segmentation",
          "Personalization",
          "Targeted communication",
          "Customer journey mapping",
          "Persona Templates",
          "Canva",
          "Design Tools",
          "Resource Sharing",
          "Persona creation methods",
          "Qualitative interviews",
          "Surveys",
          "Consumption trends",
          "Databases",
          "Persona example",
          "Persona components",
          "Background",
          "Identifiers",
          "Personality",
          "Behavior",
          "Technology usage"
        ],
        "definitions": [
          {
            "term": "Persona",
            "definition": "a semi-fictional representation of your ideal customer based on market research and real data about your existing customers"
          }
        ],
        "examples": [
          "A persona named 'Robert' who is a career-successful individual valuing family, culture, and authentic products.",
          "Jane Doe, a 21-year-old UX Designer from Atlanta.",
          "Drew, a 25-29 year old influencer and vlogger.",
          "Using personas to adapt and communicate with segments, for example, through targeted 'messages'.",
          "The numerous user persona templates available on Canva.",
          "'consumption trends' is given as an example of 'Other research'.",
          "The entire slide is a detailed example of a persona named 'Robert'.",
          "Robert reads HBR (Harvard Business Review) and FT (Financial Times)."
        ],
        "diagrams": [
          {
            "type": "embedded video",
            "key_points": [
              "The slide introduces the concept of Personas via a video.",
              "The video distinguishes between Shopper Personas and Buyer Personas."
            ],
            "description": "An embedded YouTube video player is shown. The video is paused at 0:11 of a 2:43 total length. The video thumbnail or initial frame displays the word 'PERSONAS' in large, orange, handwritten-style font, with '- SHOPPER PERSONAS' and '- BUYERS PERSONAS' written below it. The standard YouTube player controls (play/pause, volume, settings, fullscreen) are visible at the bottom."
          },
          {
            "type": "table",
            "key_points": [
              "GOALS include intellectual/cultural development and sharing time with grandchildren.",
              "EXPECTATIONS include quality, emotions, comfort, and uniqueness.",
              "QUOTES reflect the persona's life stage and values regarding authenticity and family."
            ],
            "description": "A three-section table outlining the components of a persona named 'Robert'. The sections are GOALS, EXPECTATIONS, and QUOTES, each with guiding questions and example answers."
          },
          {
            "type": "slider chart",
            "key_points": [
              "Leans towards Extrovert",
              "Leans towards Creative",
              "Leans towards Organized",
              "Leans towards Team player",
              "Leans towards Independent"
            ],
            "description": "A set of five horizontal sliders representing Jane Doe's personality on a spectrum between two opposing traits: Introvert/Extrovert, Analytical/Creative, Busy/Organized, Messy/Team player, Independent/Dependent."
          },
          {
            "type": "checklist",
            "key_points": [
              "Friends",
              "Cultural",
              "Location",
              "Learning",
              "Networking",
              "Price",
              "Credibility"
            ],
            "description": "A checklist titled 'EVENT INFLUENCERS' for the persona Drew. It lists factors that influence his event attendance, with all items checked."
          },
          {
            "type": "website screenshot",
            "key_points": [
              "Canva is presented as a tool for creating personas.",
              "A large number of templates (7,415) are available.",
              "Templates shown have titles like 'Navy and Beige M...', 'User Persona Com...', 'Introduction of User Personas'."
            ],
            "description": "A screenshot of the Canva website showing the results for a search on 'User Personas'. The page displays a grid of 7,415 available templates with various designs and layouts for creating personas."
          },
          {
            "type": "table/profile",
            "key_points": [
              "The profile provides a concrete example of how data is synthesized into a persona.",
              "It includes professional background, family details, demographic data, and psychographic identifiers like personality traits and media consumption habits."
            ],
            "description": "A structured profile of a persona named 'Robert'. The profile is divided into three main sections: BACKGROUND, DEMOGRAPHICS, and IDENTIFIERS. Each section has guiding questions (e.g., 'Job? Career path? Family?') and bullet points with specific details about Robert."
          }
        ],
        "formulas": [],
        "notes": "The slide number is 26. The footer includes the Audencia logo and logos for EQUIS, AACSB, AMBA, CEFDG, CONFERENCE DES GRANDES ECOLES, and coafm. This slide introduces the basic components of a persona using a simple template. The large 'WHAT?' suggests this slide defines what a persona consists of. A source, (Kusinitz 2014), is cited. The slide number is 27. The source for the definition is cited as Lemon & Verhoef (2016, p.73). This slide provides two detailed, visually distinct examples of user personas, showcasing different layouts and information categories. It serves as a practical illustration of how to create rich, comprehensive personas. Dribbble links are provided as sources for the templates. The slide number is 28. The source is cited as Lemon & Verhoef (2016, p.73). This slide provides a practical resource for students, directing them to Canva as a tool to find and use pre-made templates for constructing their own personas. A direct URL is provided at the bottom. The slide number is 29. The source is cited as (Kusinitz 2014). The slide number is 30. The source is cited as (Kusinitz 2014).",
        "educational_value": 1.0
      },
      {
        "name": "never stop daring",
        "slides": [
          1
        ],
        "main_text": "Audencia\naudencia.com\n\nNEVER STOP DARING\n\n\"\nCultiver l'audace, toujours et à tout âge,\ncroire en soi, se lancer, innover,\napprendre de ses échecs,\nse relever et recommencer.\nS'engager avec et pour les autres,\nagir en manager responsable,\nrespectueux et bienveillant,\nimpacter positivement la société.\n\nL'audace nous grandit,\nélargit notre horizon,\nnourrit notre imagination\npour mieux transformer le monde.\n\"",
        "key_concepts": [
          "Audacity (L'audace)",
          "Innovation",
          "Resilience",
          "Responsible Management",
          "Societal Impact",
          "Lifelong Learning",
          "Branding"
        ],
        "definitions": [
          {
            "term": "L'audace (Audacity)",
            "definition": "According to the slide, audacity is a quality to be cultivated at all ages. It involves believing in oneself, launching initiatives, innovating, learning from failures, recovering and starting again. It also entails engaging with and for others, acting as a responsible, respectful, and caring manager, and positively impacting society. It is presented as a force for personal growth, broadening horizons, and fueling imagination to transform the world."
          }
        ],
        "examples": [],
        "diagrams": [],
        "formulas": [],
        "notes": "This slide is a branding statement for the Audencia business school. The central theme is 'daring' (audace), which is framed as a core value encompassing personal development, professional ethics, and a commitment to positive societal change. The visual design, with the vertical 'DARING', reinforces the bold and dynamic message.",
        "educational_value": 0.65
      },
      {
        "name": "gen ai is reshaping customer journeys",
        "slides": [
          5
        ],
        "main_text": "Gen AI is reshaping customer journeys\n\nIllustrative\n\nhttps://www.bcg.com/publications/2024/three-ways-genai-will-transform-customer-experience\nhttps://www.bain.com/insights/generative-ai-potential-to-improve-customer-experience/\nhttps://onlinelibrary.wiley.com/doi/10.1002/mar.70036\n\nSource: BCG analysis.",
        "key_concepts": [
          "Generative AI (Gen AI)",
          "Customer Journey",
          "Personalized Advertising",
          "Augmented Reality",
          "Interactive Assistant",
          "Cost to Serve",
          "Customer Loyalty",
          "Cross-sell",
          "Up-sell"
        ],
        "definitions": [],
        "examples": [
          "Receiving personalized advertising with AI-generated content.",
          "Using an interactive assistant to browse a catalog.",
          "Using GenAI and augmented reality to demonstrate products in a physical space.",
          "Using auto-generated user guides and tutorials after purchase.",
          "A call center agent using AI dynamic scripts to troubleshoot a query.",
          "An agent receiving next-best-action prompts for cross-selling during a call."
        ],
        "diagrams": [
          {
            "type": "flowchart",
            "key_points": [
              "Gen AI can be applied across the entire customer journey, from discovery to post-purchase support.",
              "In the purchase phase, Gen AI can improve click-through rates, conversion, and brand awareness.",
              "In the post-purchase phase, Gen AI can lower returns, reduce service costs, and increase loyalty through better support and up-selling."
            ],
            "description": "A diagram showing two customer journey flows and how Gen AI can impact them. The top flow represents the purchase journey (Discovery -> Research -> Comparison -> Purchase decision -> Payment -> Delivery). The bottom flow represents the post-purchase journey (Setup -> Use -> Issue resolution -> Reconsideration). Callout boxes link specific Gen AI applications to business outcomes at various stages. For example, 'I receive personalized advertising with AI-generated content and images' leads to 'Improved click-through rate' at the Discovery stage. 'I talk to a call center agent who uses AI dynamic scripts to troubleshoot my query' leads to 'Reduced cost to serve' at the Issue resolution stage."
          }
        ],
        "formulas": [],
        "notes": "Slide number 20. The slide is illustrative and cites 'BCG analysis' as the source. It includes links to articles from BCG, Bain, and Wiley for further reading.",
        "educational_value": 0.9
      },
      {
        "name": "le wagon first sessions",
        "slides": [
          5
        ],
        "main_text": "• How it works\n• Make sure you received an e-mail explaining how to access the platform\n• Check the video on BlackBoard that explains how to approach these 2 online sessions\n• Before next off-line session (in 2 weeks), you MUST go through the following contents on LeWagon :\n  • Introduction\n  • Using Designer Tools\n  • Product Pitch\n  • UX Personas\n  • User Journeys\n  • User flow",
        "key_concepts": [
          "Le Wagon",
          "BlackBoard",
          "Online Sessions",
          "Designer Tools",
          "Product Pitch",
          "UX Personas",
          "User Journeys",
          "User flow"
        ],
        "definitions": [],
        "examples": [
          "The list of contents to complete on LeWagon: Introduction, Using Designer Tools, Product Pitch, UX Personas, User Journeys, User flow."
        ],
        "diagrams": [
          {
            "type": "screenshot",
            "key_points": [
              "The screenshot provides a visual guide to the Le Wagon platform.",
              "It shows the structure of the course content students need to navigate.",
              "A specific video presentation is highlighted as an important resource."
            ],
            "description": "A screenshot of the Le Wagon online learning platform interface is shown on the right side of the slide. It displays a course curriculum with sections like 'Product Design', 'Product Pitch', and 'UX Deep Dive'. Specific modules listed include 'WELCOME, WAGON', 'WIREFRAMING', 'BRANDING & UI', and 'UI KITS'. A red box highlights a video thumbnail titled 'Le Wagon Video Presentation'."
          }
        ],
        "formulas": [],
        "notes": "This slide provides instructions for students on how to prepare for the Le Wagon sessions. It sets a deadline ('in 2 weeks') and lists mandatory content to be completed. The slide number is 40.",
        "educational_value": 0.49999999999999994
      }
    ],
    "semantic_chunks": [
      {
        "topics": [
          "the customer journey"
        ],
        "content": "## Topic: The Customer Journey\n(Source slides: 1, 1, 1, 2, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 5)\n\n### Content\n• Pre purchase, purchase and post purchase stages\n\nPurchase Stage:\nThis stage encompasses all customer interactions with the brand during the purchase. It includes behaviors such as choice, ordering, and payment. It is considered as the most “temporally compressed” of the three stages.\n\nThe Customer Journey\n\n- Types of Touch Points\n\nPartner-owned touch points:\n\nThese touch points are jointly designed, controlled and managed by the firm and its partner(s). The partners could be multivendor partners, multichannel distributors partners, communication partners, etc.\n\nThe Customer Journey\n\n- Types of Touch Points\n\nSocial/external touch points:\n\nThese touch points are all external people that may influence the customer experience. It may concerns the advices of customers (e.g. Comments on TripAdvisor) or peer influences, independent information sources, etc. Sometimes influencers may be independent and sometimes they are in line with firm expectations. Lemon & Verhoef (2016)\n\nIt includes the use/consumption of the product/service, and service requests. It is an important phase where the customer will evaluate his shopping experience. Based on this evaluation, he will engage or not with the brand, become loyal or not, use negative or positive W.O.M’s.\n\n• Today's exercise\n\nCustomer activities\n(what is the customer doing?)\n\nExperience (what is the customer's feeling : positive, negative, neutral; High versus Low)\n\nTouchpoints\n\n• Types of Touch Points\n\nBrand-owned touch points:\nThese touch points customer interactions are designed, controlled and managed by the firm. It may concern the marketing mix (products, price strategy, service, distribution) and more broadly the brand owned media such as advertising, websites, loyalty programs, etc.\n\nThe Customer Journey Map\n\n- What are the steps in a customer journey? Customer activities\n(what is the customer doing?)\n\nExperience (what is the customer's feeling : positive, negative, neutral; High versus Low)\n\nTouchpoints\n\n• Example Nike\n\nhttps://www.questionpro.com/blog/nike-customer-experience/\n\nThe Customer Journey\n\nOverview of the Customer Journey\n\nFeedback\n\nPREVIOUS EXPERIENCE (t-n)\nPrepurchase Stage\nPurchase Stage\nPostpurchase Stage\n\nCURRENT EXPERIENCE (t)\nPre purchase Stage\nTouchpoints: Brand owned, partner owned, customer owned, social/external\nBehaviors: need recognition, consideration, search\n\nPurchase Stage\nTouchpoints: Brand owned, partner owned, customer owned, social/external\nBehaviors: choice, ordering, payment\n\nPost purchase Stage\nTouchpoints: Brand owned, partner owned, customer owned, social/external\nBehaviors: consumption, usage, engagement, service requests\n\nFUTURE EXPERIENCE (t+n)\nPrepurchase Stage\nPurchase Stage\nPostpurchase Stage\n\nCustomer Journey\n\nExtracted from Lemon & Verhoef (2016, p. 77)\n\nThe Customer Journey\n\n- Types of Touch Points\n\nCustomer-owned touch points:\n\nThese touch points concerned all customer actions that are part of the customer experience. The company, its partners or others do not influence or control these actions. These actions may include customers reflecting on their needs and desires and the transformation of a company product into a use not intended by the firm.\n\nThe Customer Journey Map\n\n- Example\n\nhttps://miro.com/miroverse/fly-ux-customer-journey-map/\n\nFly UX - Customer Journey Map\n\nFly UX Customer Journey Map by Eva Huse Pedersen\nMiro.com\n\nThe Customer Journey\n\nPre purchase, purchase and post purchase stages\n\nPre purchase Stage:\nThis stage encompasses all direct or indirect customer interactions with the brand before the purchase. It generally starts with the “need/goal/impulse recognition to consideration of satisfying that need/goal/impulse with a purchase” including the search stage (Lemon & Verhoef, 2016, p.76).\n\nNike Customer Journey\n\n• Today's exercise\n\n• Groups of 2\n\n• Create a persona corresponding to a segment of the Nike brand. • Map the customer journey of this persona to buy Nike sneakers online\n\n• Be ready to present in front of everyone 🙂\n\n### Definitions\n- **Purchase Stage**: This stage encompasses all customer interactions with the brand during the purchase. It includes behaviors such as choice, ordering, and payment. It is considered as the most “temporally compressed” of the three stages.\n- **Partner-owned touch points**: These touch points are jointly designed, controlled and managed by the firm and its partner(s). The partners could be multivendor partners, multichannel distributors partners, communication partners, etc.\n- **Social/external touch points**: These touch points are all external people that may influence the customer experience. It may concerns the advices of customers (e.g. Comments on TripAdvisor) or peer influences, independent information sources, etc. Sometimes influencers may be independent and sometimes they are in line with firm expectations.\n- **Post purchase Stage**: The last stage concerns all interactions with the brand and its environment after purchase. It includes the use/consumption of the product/service, and service requests. It is an important phase where the customer will evaluate his shopping experience. Based on this evaluation, he will engage or not with the brand, become loyal or not, use negative or positive W.O.M’s.\n- **Brand-owned touch points**: These touch points customer interactions are designed, controlled and managed by the firm. It may concern the marketing mix (products, price strategy, service, distribution) and more broadly the brand owned media such as advertising, websites, loyalty programs, etc.\n- **Customer-owned touch points**: These touch points concerned all customer actions that are part of the customer experience. The company, its partners or others do not influence or control these actions. These actions may include customers reflecting on their needs and desires and the transformation of a company product into a use not intended by the firm.\n- **Pre purchase Stage**: This stage encompasses all direct or indirect customer interactions with the brand before the purchase. It generally starts with the “need/goal/impulse recognition to consideration of satisfying that need/goal/impulse with a purchase” including the search stage (Lemon & Verhoef, 2016, p.76).\n\n### Key Concepts: Customer Journey, Purchase Stage, Pre purchase, Post purchase, Touchpoints, Behaviors, Temporally compressed, Touch Points, Partner-owned touch points, Social/external touch points, Customer Experience, Peer Influence, Influencers, Post purchase Stage, Customer Evaluation, Brand Loyalty, Word-of-Mouth (W.O.M.), Consumption, Service Requests, E-commerce, Multichannel distributor, Influencer Marketing, Social Media, Product Reviews, Customer Journey Mapping, Prepurchase, Purchase, Postpurchase, Customer Activities, Brand-owned touch points, Marketing Mix, Brand owned media, Sponsorship, Communication partner, Customer Journey Map, Customer Journey Stages, Awareness, Consideration, Decision, Service, Loyalty, Touchpoint, Customer Actions, Experience, Pain Points, Potential Solution, Customer Journey Overview, Previous Experience, Current Experience, Future Experience, Pre-purchase Stage, Post-purchase Stage, Customer Behaviors, Feedback Loop, Brand Touchpoints, Pre-purchase, Post-purchase, Customer-owned touch points, Unintended product use, User Experience (UX), Customer Goals, Customer Behaviours, Journey Stages, Customer Interactions, Need Recognition, Search Stage, Website, Advertising, Product Customization, User-generated content, Product modification, IKEA Hacking, Persona Application, Brand Segmentation, Group Exercise, Presentation\n\n### Examples\n- multivendor partners\n- multichannel distributors partners\n- communication partners\n- Comments on TripAdvisor\n- The 'wethenew' website selling Air Jordan sneakers is an example of a partner-owned touch point, specifically a multichannel distributor.\n- A screenshot of a YouTube video titled 'Air Jordan 1 Mid Chicago Black Toe REVIEW and ON-FEET!', showing a product review which is a form of external touchpoint.\n- A screenshot of an Instagram post from the influencer 'xsqueezie' announcing a collaboration with Nike. The caption (in French) discusses a new fitness program in partnership with Nike, illustrating an influencer acting as an external touchpoint in line with firm expectations.\n- Gillette\n- Mitsubishi\n- Coca-Cola\n- IBM\n- Walt Disney\n- MasterCard\n- Nescafé\n- Visa\n- BIC\n- Philips\n- Ford\n- FedEx\n- Esso\n- Vodafone\n- Pampers\n- IKEA\n- Intel\n- Microsoft\n- Bosch\n- Durex\n- Heineken\n- Adobe\n- Red Bull\n- Samsung\n- A sponsored sports team (like the French national football team) is an example of a partner-owned touch point, representing a communication partnership.\n- The entire slide is a detailed example of a Customer Journey Map for the brand Nike.\n- Customers reflecting on their needs and desires.\n- The transformation of a company product into a use not intended by the firm.\n- The entire 'Fly UX - Customer Journey Map' is an example. Specific pain points mentioned include communication issues, confusing options, language barriers on the website, and lack of clarity on fare inclusions.\n- Nike's e-commerce website\n- Nike's print/digital advertising\n- Nike's product customization service ('Nike By You')\n- The 'IKEA hackers' website, where customers share modifications to IKEA products, is an example of a customer-owned touch point.\n- The exercise itself is an example: creating a persona for a Nike brand segment and mapping their journey to buy sneakers online.\n\n### Visual Elements\n- [flowchart] A flowchart diagram illustrates the three stages of the customer journey as three sequential, overlapping chevrons pointing from left to right. The first stage is 'Prepurchase Stage' in blue. The middle stage, 'Purchase Stage', is highlighted in yellow. The final stage is 'Postpurchase Stage' in blue. Each chevron contains information about its respective touchpoints and behaviors.\n  Key points: Prepurchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: need recognition, consideration, search., Purchase Stage (Yellow Highlighted Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: choice, ordering, payment., Postpurchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: consumption, usage, engagement, service requests.\n- [flowchart] A flowchart diagram illustrates the three stages of the customer journey as three sequential, overlapping chevrons pointing from left to right. The first stage is 'Prepurchase Stage' in blue. The middle stage is 'Purchase Stage' in blue. The final stage, 'Postpurchase Stage', is highlighted in yellow. Each chevron contains information about its respective touchpoints and behaviors.\n  Key points: Prepurchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: need recognition, consideration, search., Purchase Stage (Blue Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: choice, ordering, payment., Postpurchase Stage (Yellow Highlighted Chevron): Touchpoints: Brand owned, partner owned, customer owned, social/external. Behaviors: consumption, usage, engagement, service requests.\n- [screenshot] A screenshot of a product page from the e-commerce website 'wethenew'. The page displays the 'Air Jordan 1 Mid Chicago Black Toe' sneaker. Key elements shown are the product image, product name, price (€280.00), installment payment options (2x, 3x, 4x), loyalty points (+280 points de fidélité), size selection (TAILLE), a guide to sizes (GUIDE DES TAILLES), an 'Add to cart' button (Ajouter au panier), and delivery information (48H Livraison). The top navigation includes a search bar, user account, wishlist, and cart icons.\n  Key points: Product: Air Jordan 1 Mid Chicago Black Toe, Retailer: wethenew, Price: €280.00, Features: Installment payments, loyalty program, express delivery.\n- [flowchart and table] The slide presents a template for a customer journey map. At the top, a flowchart shows three main phases: 'Prepurchase', 'Purchase', and 'Postpurchase', connected by arrows. Below this, a red bar is divided into six sequential steps: 'Step 1' through 'Step 6'. The main body is a table with three rows labeled: 'Customer activities (what is the customer doing?)', 'Experience (what is the customer's feeling : positive, negative, neutral; High versus Low)', and 'Touchpoints'. The table columns correspond to the six steps and are currently empty, intended for an exercise.\n  Key points: The customer journey is divided into three main phases: Prepurchase, Purchase, and Postpurchase., The journey is further broken down into 6 specific steps., The map tracks three key aspects at each step: Customer activities, Experience/Feelings, and Touchpoints.\n- [image collage] A collage of numerous well-known brand logos, serving as examples of brands that manage their own touch points.\n- [framework/table] A template for a customer journey map. It has a timeline at the top divided into three main stages: Prepurchase, Purchase, and Postpurchase. Below this, the timeline is marked with six steps (Step 1 to Step 6). Step 1, 2, 3 are under Prepurchase; Step 4 is under Purchase; Step 5, 6 are under Postpurchase. The rows below are categories for analysis at each step: 'Customer activities (what is the customer doing?)', 'Experience (what is the customer's feeling : positive, negative, neutral; High versus Low)', and 'Touchpoints'.\n  Key points: The customer journey is divided into Prepurchase, Purchase, and Postpurchase stages., Each stage consists of multiple steps., For each step, the map analyzes customer activities, their emotional experience, and the touchpoints they interact with.\n- [table/matrix] A detailed customer journey map for the brand Nike, structured as a grid. The columns represent the five stages of the journey: Awareness, Consideration, Decision, Service, and Loyalty. The rows represent different aspects of the customer experience: TOUCHPOINT, Customer Actions, Experience, Pain Points, and Potential Solution. The 'Experience' row includes a line graph with emoticons (sad, neutral, happy, frustrated, very happy) plotting the emotional journey of the customer through the stages. Each cell in the grid contains specific information for Nike. For example, in the 'Awareness' stage, the touchpoint is 'Nike.com', the customer action is visiting the website, the pain point is 'Difficulty in finding desired items', and the potential solution is to 'Enhance website navigation and search functionality'.\n  Key points: Awareness Stage: Touchpoint is Nike.com; customer feels interested but hesitant due to difficulty finding items., Consideration Stage: Touchpoint is Product Pages; customer is curious but faces uncertainty about product features., Decision Stage: Touchpoint is Online Shopping; customer is excited but faces a lengthy checkout process., Service Stage: Touchpoint is Returns and Exchanges; customer is frustrated due to complicated return processes., Loyalty Stage: Touchpoint is Exclusive Drops; customer is satisfied and happy but has limited opportunities for early access.\n- [flowchart] A flowchart illustrating the Customer Journey over time. It is divided into three main columns: 'PREVIOUS EXPERIENCE (t-n)', 'CURRENT EXPERIENCE (t)', and 'FUTURE EXPERIENCE (t+n)'. A large yellow arrow labeled 'Customer Journey' flows from left to right underneath these columns. The 'CURRENT EXPERIENCE' column is further subdivided into three sequential stages: 'Pre purchase Stage' (green), 'Purchase Stage' (yellow), and 'Post purchase Stage' (orange). Each of these stages lists associated 'Touchpoints' and 'Behaviors'. Specifically:\n- Pre purchase Stage: Touchpoints include Brand owned, partner owned, customer owned, social/external. Behaviors include need recognition, consideration, search.\n- Purchase Stage: Touchpoints include Brand owned, partner owned, customer owned, social/external. Behaviors include choice, ordering, payment.\n- Post purchase Stage: Touchpoints include Brand owned, partner owned, customer owned, social/external. Behaviors include consumption, usage, engagement, service requests.\nA 'Feedback' loop is shown with arrows pointing from the Current Experience stages back to influence the Previous Experience.\n  Key points: The customer journey is a process over time, influenced by past experiences and shaping future ones., The current experience is comprised of pre-purchase, purchase, and post-purchase stages., Each stage involves various touchpoints (brand, partner, customer, and social/external owned)., Each stage is characterized by specific customer behaviors., There is a feedback mechanism where the current experience informs future 'previous experiences'.\n- [concept map] A diagram titled 'BRAND TOUCHPOINTS' which maps various touchpoints to the three customer journey stages. The stages (PRE-PURCHASE, PURCHASE, POST-PURCHASE) are listed at the bottom. An overarching orange arrow labeled 'CUSTOMER EXPERIENCE' spans the top. Touchpoints are represented as colored circles (blue and orange) and are grouped under their relevant stage.\n  Key points: PRE-PURCHASE Touchpoints: SOCIAL MEDIA, ADS, MARKETING, DISPLAYS, PROMOS, EMAIL, DIRECT MAIL, PR, WORD OF MOUTH., PURCHASE Touchpoints: SALES PERSON, UP SALE, PACKAGING, ECOMMERCE, WEB, STORE OR OFFICE, CATALOGUE., POST-PURCHASE Touchpoints: INVOICE, EVENTS, SURVEYS, CUSTOMER SERVICE, BILLING, FORUMS, SOCIAL MEDIA, NEWS LETTER, LOYALTY PROGRAM, BRAND PROMISE.\n- [table/chart] An example of a detailed Customer Journey Map for a fictional airline, 'Fly UX'. The map is a grid with columns representing stages of the journey and rows representing different aspects of the customer experience. \n- Stages (Columns): Awareness, Consideration, Booking Page - Search flight, Flight Search Result, Select Fare. \n- Aspects (Rows): Goals, Behaviours, Connect, Pain Points. \nEach cell contains bullet points detailing the customer's experience at that stage. For example, under 'Consideration', a 'Pain Point' is 'The options are changing very quickly and that makes it confusing'. Under 'Select Fare', a 'Goal' is 'I want to understand what value I get for the price' and a 'Pain Point' is 'I am not sure what is included in the fare'.\n  Key points: The map provides a step-by-step analysis of a customer's interaction with a service., It tracks customer goals, behaviors, and pain points at each stage., Identifying pain points is crucial for improving the overall customer experience.\n- [diagram] A simplified visual representation of the customer journey stages, shown as three connected chevrons pointing from left to right. The first chevron is green and labeled 'Prepurchase Stage', listing 'Touchpoints: Brand owned, partner owned, customer owned, social/external' and 'Behaviors: need recognition, consideration, search'. The subsequent chevrons for 'Purchase Stage' and 'Postpurchase Stage' are shaded in blue and contain similar labels for touchpoints and behaviors, though the text is less prominent. The Pre-purchase stage is visually highlighted.\n  Key points: The Pre-purchase stage is the first phase of the customer journey., It involves specific touchpoints and behaviors like need recognition and search.\n- [image examples] The slide displays three visual examples of Nike's brand-owned touch points. 1) Top-left: A screenshot of the Nike e-commerce website, showing a promotional banner for '30% OFF EVERYTHING'. 2) Bottom-left: A Nike advertisement with a young girl running, featuring the slogan 'It's only a crazy dream until you do it. Just do it.'. 3) Right: A screenshot of the Nike 'By You' product customization page, showing a personalized shoe and the text 'Chaussures Personnalisées Nike By You'.\n  Key points: Example 1: Nike website with a '30% OFF EVERYTHING' promotion., Example 2: Nike 'Just do it.' advertisement with the tagline 'It's only a crazy dream until you do it.', Example 3: Nike 'By You' product customization tool, labeled in French 'Chaussures Personnalisées Nike By You'.\n- [screenshot] A screenshot of the 'IKEA hackers' website homepage. The logo is a stylized version of the IKEA logo. The main navigation includes HACKS, IDEAS, BEST OF, START HERE, SUBMIT HACK, and SHOP. The main heading is 'HACKS'. The text describes how to transform, upcycle, and customize IKEA furniture. It mentions specific examples like adding legs to a KALLAX shelf or creating LEGO storage. Below this is a section titled 'Popular Ikea Hacking Categories' with image links to 'Living Room', 'Dining', 'Dividers', and 'Desks'.\n  Key points: Website: IKEA hackers, Concept: Modifying and customizing IKEA products., Functionality: Showcasing ideas, categories, and allowing users to submit hacks., Example of: Transformation of a product for unintended uses, a customer-owned touch point.\n- [icon] An icon in the bottom right corner shows a message/chat interface with a large red circle containing a white clock symbol overlaid on top of it, suggesting a timed activity or presentation.",
        "key_concepts": [
          "Customer Journey",
          "Purchase Stage",
          "Pre purchase",
          "Post purchase",
          "Touchpoints",
          "Behaviors",
          "Temporally compressed",
          "Touch Points",
          "Partner-owned touch points",
          "Social/external touch points"
        ],
        "educational_value": 1.0
      },
      {
        "topics": [
          "the construction of personas"
        ],
        "content": "\n\n==================================================\n## Topic: The Construction Of Personas\n(Source slides: 1, 1, 2, 2, 3, 3, 4, 5)\n\n### Content\nThe construction of Personas\n\n• What is a Persona? [Embedded YouTube Video]\nPERSONAS\n- SHOPPER PERSONAS\n- BUYERS PERSONAS\n\nhttps://www.youtube.com/watch?v=AVs59ddkzuQ\n\nThe construction of Personas\n\n• How do we create them? WHAT? Name: Robert\n\nGOALS\nPrimary goal? Secondary goal? • Intellectual and cultural development\n• Sharing time and experience with her grandchildren\n\nEXPECTATIONS\nPrimary expectation? Secondary expectation? • Quality\n• Emotions\n• Comfort\n• Uniqueness, originality\n\nQUOTES\nAbout goals, expectations, etc. • \"Now I've achieved a successful career, I want to enjoy my life in sharing time with my family\". • \"I love authentic products whose originality, quality and passion for making them can be appreciated.\"\n\n(Kusinitz 2014)\n\nA persona is « a semi-fictional representation of your ideal customer based on market research and real data about your existing customers »\n\nLemon & Verhoef (2016, p.73)\n\nUSER PERSONA\nJane Doe\nABOUT\nJane is a UX Designer that works for a Fortune 500 company in Atlanta, GA. Ever since she was a child, she loved to make stuff on her own and show them to her parents, friends and classmates. Over the course of her childhood and throughout high school, she won numerous design prizes at various art contests both locally and in the United States and Canada. Due to her passion for design, she decided to pursue a Master's degree in Human-Computer Interaction and learn more about User Experience (UX) and how she can become a better designer. \"I design with all my heart, thinking about the users\"\nAGE 21\nJOB TITLE UX Designer\nSTATUS Single\nLOCATION Atlanta, GA\nPASSIONATE EMPATHETIC CURIOUS ADVENTUROUS\nFAVORITE BRANDS\n[Facebook, Spotify, Coca-Cola logos]\nGOALS\n• Become a designer who communicates well her ideas at any place\n• Easily explain her design ideas to other designers, researchers and engineers\nPAIN POINTS\n• There are too many tools that forces her to spend time learning them\n• Cannot rely on other people's opinion because they are highly subjective\n• Certain situations require different tools to communicate her thoughts\nNEEDS\n• Looking for a design tool that helps to cut down unnecessary time and effort\n• Receive feedback on her progress whenever needed before presentation\n\nDrew\nInfluencer\nABOUT\nAge 25-29\nSkill: Vlogger\nHigh tech proficiency\nEVENT ATTENDANCE ATTRIBUTES\nFrequent event goer (monthly). Tied to the city for work. Would travel nationally/internationally for an event. Tends to go to events with a few friends. MOTIVATIONS\nHis favorite thing is to find & share them with network, helping influence. Being the first to know about something and share it gives him a thrill. CORE NEEDS\nFinding events on social media and being able to find tickets easily. Knowing what the trending events that will sell out are. Also, being able to buy tickets last minute with the first to get tickets. PAIN POINTS\nFinding the time to attend events and staying on budget. 39% Total Universe D18+ (Event Goers)\n12 Events per month\n\nhttps://dribbble.com/shots/4152326-Free-Template-User-Persona-Black-White\nhttps://dribbble.com/shots/3338369-User-Personas-attachments/723326\n\nThe construction of Personas\n\n• Why using Personas? Buyer Personas allow companies :\n- To have a clear idea of their different customers through characters (to make alive their segments)\n- Easily adapt, personalize, communicate with each segment (e.g. messages)\n- Mapping the different customer journeys by segments\n\nLemon & Verhoef (2016, p.73)\n\nThe construction of Personas\n\n• Another link on Canva\n\n[Screenshot of Canva website]\n\nCanva\nAccueil\nEntreprise\nEnseignement\nRecherchez des milliers de m... Créer un design\n\nPersonnel\n\nModèles Canva\n\nTous les filtres\nCatégorie\n\n7,415 templates\n\n[Thumbnails of various User Persona templates]\n\nhttps://www.canva.com/templates/s/user-persona/\n\nThe construction of Personas\n\n• What do we need to create them? Buyer personas are created through:\n- Qualitative interviews\n- Surveys\n- Other research (e.g. consumption trends)\n- Data bases (internal or external)\n\n(Kusinitz 2014)\n\nWHO? Name: Robert\n\nBACKGROUND\nJob? Career path? Family? • Head of Marketing Department\n• Worked at the same company for 30 years; he was brand manager before\n• Married with 3 children (25, 29 and 32)\n\nDEMOGRAPHICS\nGender? Age? Income? Location? • Gender male\n• Age 55-60\n• Income: $220,000\n• Suburban, owner\n\nIDENTIFIERS\nPersonality? Behavior? Technology? Social media? • Calm, curious\n• Passionate person who takes a long time before buying a product\n• Try to disconnect from technology to enjoy real life (low use of smartphone and social media)\n• Read HBR and FT\n\n(Kusinitz 2014)\n\n### Definitions\n- **Persona**: a semi-fictional representation of your ideal customer based on market research and real data about your existing customers\n\n### Key Concepts: Persona, Shopper Persona, Buyer Persona, Persona Construction, Goals, Expectations, Quotes, Persona definition, Semi-fictional representation, Ideal customer, Market research, Customer data, User Persona, UX Designer, Influencer, Demographics, Pain Points, Needs, Motivations, Personality Traits, Customer segmentation, Personalization, Targeted communication, Customer journey mapping, Persona Templates, Canva, Design Tools, Resource Sharing, Persona creation methods, Qualitative interviews, Surveys, Consumption trends, Databases, Persona example, Persona components, Background, Identifiers, Personality, Behavior, Technology usage\n\n### Examples\n- A persona named 'Robert' who is a career-successful individual valuing family, culture, and authentic products.\n- Jane Doe, a 21-year-old UX Designer from Atlanta.\n- Drew, a 25-29 year old influencer and vlogger.\n- Using personas to adapt and communicate with segments, for example, through targeted 'messages'.\n- The numerous user persona templates available on Canva.\n- 'consumption trends' is given as an example of 'Other research'.\n- The entire slide is a detailed example of a persona named 'Robert'.\n- Robert reads HBR (Harvard Business Review) and FT (Financial Times).\n\n### Visual Elements\n- [embedded video] An embedded YouTube video player is shown. The video is paused at 0:11 of a 2:43 total length. The video thumbnail or initial frame displays the word 'PERSONAS' in large, orange, handwritten-style font, with '- SHOPPER PERSONAS' and '- BUYERS PERSONAS' written below it. The standard YouTube player controls (play/pause, volume, settings, fullscreen) are visible at the bottom.\n  Key points: The slide introduces the concept of Personas via a video., The video distinguishes between Shopper Personas and Buyer Personas.\n- [table] A three-section table outlining the components of a persona named 'Robert'. The sections are GOALS, EXPECTATIONS, and QUOTES, each with guiding questions and example answers.\n  Key points: GOALS include intellectual/cultural development and sharing time with grandchildren., EXPECTATIONS include quality, emotions, comfort, and uniqueness., QUOTES reflect the persona's life stage and values regarding authenticity and family.\n- [slider chart] A set of five horizontal sliders representing Jane Doe's personality on a spectrum between two opposing traits: Introvert/Extrovert, Analytical/Creative, Busy/Organized, Messy/Team player, Independent/Dependent.\n  Key points: Leans towards Extrovert, Leans towards Creative, Leans towards Organized, Leans towards Team player, Leans towards Independent\n- [checklist] A checklist titled 'EVENT INFLUENCERS' for the persona Drew. It lists factors that influence his event attendance, with all items checked.\n  Key points: Friends, Cultural, Location, Learning, Networking, Price, Credibility\n- [website screenshot] A screenshot of the Canva website showing the results for a search on 'User Personas'. The page displays a grid of 7,415 available templates with various designs and layouts for creating personas.\n  Key points: Canva is presented as a tool for creating personas., A large number of templates (7,415) are available., Templates shown have titles like 'Navy and Beige M...', 'User Persona Com...', 'Introduction of User Personas'.\n- [table/profile] A structured profile of a persona named 'Robert'. The profile is divided into three main sections: BACKGROUND, DEMOGRAPHICS, and IDENTIFIERS. Each section has guiding questions (e.g., 'Job? Career path? Family?') and bullet points with specific details about Robert.\n  Key points: The profile provides a concrete example of how data is synthesized into a persona., It includes professional background, family details, demographic data, and psychographic identifiers like personality traits and media consumption habits.",
        "key_concepts": [
          "Persona",
          "Shopper Persona",
          "Buyer Persona",
          "Persona Construction",
          "Goals",
          "Expectations",
          "Quotes",
          "Persona definition",
          "Semi-fictional representation",
          "Ideal customer",
          "Market research",
          "Customer data",
          "User Persona",
          "UX Designer",
          "Influencer"
        ],
        "educational_value": 1.0
      },
      {
        "topics": [
          "gen ai is reshaping customer journeys",
          "mckinsey purchasing funnel"
        ],
        "content": "\n\n==================================================\n## Topic: Gen Ai Is Reshaping Customer Journeys\n(Source slides: 5)\n\n### Content\nGen AI is reshaping customer journeys\n\nIllustrative\n\nhttps://www.bcg.com/publications/2024/three-ways-genai-will-transform-customer-experience\nhttps://www.bain.com/insights/generative-ai-potential-to-improve-customer-experience/\nhttps://onlinelibrary.wiley.com/doi/10.1002/mar.70036\n\nSource: BCG analysis.\n\n### Key Concepts: Generative AI (Gen AI), Customer Journey, Personalized Advertising, Augmented Reality, Interactive Assistant, Cost to Serve, Customer Loyalty, Cross-sell, Up-sell\n\n### Examples\n- Receiving personalized advertising with AI-generated content.\n- Using an interactive assistant to browse a catalog.\n- Using GenAI and augmented reality to demonstrate products in a physical space.\n- Using auto-generated user guides and tutorials after purchase.\n- A call center agent using AI dynamic scripts to troubleshoot a query.\n- An agent receiving next-best-action prompts for cross-selling during a call.\n\n### Visual Elements\n- [flowchart] A diagram showing two customer journey flows and how Gen AI can impact them. The top flow represents the purchase journey (Discovery -> Research -> Comparison -> Purchase decision -> Payment -> Delivery). The bottom flow represents the post-purchase journey (Setup -> Use -> Issue resolution -> Reconsideration). Callout boxes link specific Gen AI applications to business outcomes at various stages. For example, 'I receive personalized advertising with AI-generated content and images' leads to 'Improved click-through rate' at the Discovery stage. 'I talk to a call center agent who uses AI dynamic scripts to troubleshoot my query' leads to 'Reduced cost to serve' at the Issue resolution stage.\n  Key points: Gen AI can be applied across the entire customer journey, from discovery to post-purchase support., In the purchase phase, Gen AI can improve click-through rates, conversion, and brand awareness., In the post-purchase phase, Gen AI can lower returns, reduce service costs, and increase loyalty through better support and up-selling.\n\n==================================================\n## Topic: Mckinsey Purchasing Funnel\n(Source slides: 1, 2, 3, 4)\n\n### Content\nMcKinsey purchasing funnel\n• 5 steps purchasing funnel\n\n### Key Concepts: McKinsey purchasing funnel, Awareness, Familiarity, Consideration, Purchase, Loyalty, Online vs Offline channels, Solution Evaluation, Evaluation of the Purchasing Experience, Shopping Value, Value in use, Customer journey mapping, Brand consideration set, Brand choice, Camera market\n\n### Examples\n- A customer journey for purchasing a camera, starting with awareness of brands like Nikon, Sony, Canon, etc., and ending with the purchase of a Canon 5D MK4.\n- A customer journey for purchasing a camera, showing brands like Nikon, Sony, Canon, etc., and culminating in the purchase of a Canon product.\n\n### Visual Elements\n- [flowchart] A five-stage flowchart representing the McKinsey purchasing funnel. The stages are labeled from left to right: AWARENESS, FAMILIARITY, CONSIDERATION, PURCHASE, LOYALTY. Each stage is depicted with a group of circles, which decrease in number at each subsequent stage, symbolizing the narrowing of choices. \nStage 1 (AWARENESS): A grid of 24 circles (12 orange, 12 white outline).\nStage 2 (FAMILIARITY): A grid of 12 circles (6 orange, 6 white outline).\nStage 3 (CONSIDERATION): A grid of 6 circles (3 orange, 3 white outline).\nStage 4 (PURCHASE): A row of 3 circles (2 orange, 1 white outline).\nStage 5 (LOYALTY): Represented by a single sun-like icon, symbolizing the final choice and brand loyalty.\n  Key points: The funnel illustrates a progressive reduction of options., The process starts with broad awareness of many options., It narrows down to familiarity with a smaller set., Further narrowing occurs during the consideration phase., A purchase decision is made from a very small set of options., The final stage is achieving customer loyalty.\n- [diagram] A detailed diagram of the 5-step purchasing funnel, showing specific marketing channels and customer activities within each stage. The funnel is divided horizontally into 'ONLINE' and 'OFFLINE' sections. The entire process is bracketed by 'Solution Evaluation' at the top and 'Evaluation of the Purchasing Experience' and 'Shopping Value' at the bottom. The funnel begins with a shopping cart icon and ends with an icon of a person holding a shopping bag, labeled 'Value in use'.\n\n- **AWARENESS:**\n  - ONLINE: SEO, e-targeting, Social media, Banners, Mobile Marketing, SEA, Blog, Website, Youtube\n  - OFFLINE: Cinema, Radio, Press, Billboard, Mailing, Catalog, TV, POS, Sponsoring, Display\n\n- **FAMILIARITY:**\n  - ONLINE: SEO, Consumer opinion, Social media, Rankings, Mobile Marketing, Newsletter, Website, Blog, Youtube\n  - OFFLINE: Recommendations, Press, Radio, Billboard, Word of Mouth, Catalog, Cinema, POS, Display\n\n- **CONSIDERATION:**\n  - ONLINE: e-Mailing, Consumer opinion, Website, Newsletter, Blog, Youtube\n  - OFFLINE: Recommendations, Press, TV, Offers, Location, Coupons, Word of Mouth, Catalog, Cinema\n\n- **PURCHASE:**\n  - ONLINE: POS, e-mail Conversation, Checkout\n  - OFFLINE: Cash register ticket, Chat, Receipt\n\n- **LOYALTY:**\n  - ONLINE: Newsletter, Social media\n  - OFFLINE: Loyalty card, Mailing\n  Key points: The funnel maps specific online and offline marketing tactics to each stage of the customer journey., The customer journey involves both 'Solution Evaluation' and 'Evaluation of the Purchasing Experience'., The goal is to provide 'Shopping Value' and achieve 'Value in use' for the customer., Different channels are effective at different stages of the funnel.\n- [diagram] An example application of the McKinsey purchasing funnel for buying a camera. The diagram structure is the same as the previous slide, with ONLINE/OFFLINE channels and the five stages. It shows the narrowing of camera brands considered by a consumer throughout the journey. It starts with an icon of a person with a camera pushing a shopping cart, which contains a camera icon. It ends with an icon of a person holding a camera and a shopping bag, with the final product 'CANON 5D MK4' specified.\n\n- **AWARENESS:**\n  - ONLINE: Google, Facebook, 500px, ADS, Youtube, Blog, Website\n  - OFFLINE: Cinema, Billboard, Press, FNAC, Friends\n  - Brands considered: NIKON, OLYMPUS, PENTAX, SONY, CANON, PANASONIC\n\n- **FAMILIARITY:**\n  - ONLINE: SEO, Consumer opinion, Social media, Rankings, Mobile Marketing, Newsletter, Website, Blog, Youtube\n  - OFFLINE: Recommendations, Press, Radio, Billboard, Mailing, Catalog, Cinema, POS, Display\n  - Brands considered: PENTAX, SONY, CANON, NIKON, OLYMPUS\n\n- **CONSIDERATION:**\n  - ONLINE: e-Mailing, Consumer opinion, Website, Newsletter, Blog, Youtube\n  - OFFLINE: Recommendations, Press, TV, Offers, Location, Coupons, Word of Mouth, Catalog, Cinema\n  - Brands considered: SONY, CANON, NIKON\n\n- **PURCHASE:**\n  - ONLINE: POS, e-mail Confirmation, Checkout\n  - OFFLINE: Cash register ticket, Receipt\n  - Brand purchased: CANON\n\n- **LOYALTY:**\n  - ONLINE: Newsletter, Social media\n  - OFFLINE: Loyalty card, Mailing\n  - Loyal product: CANON 5D MK4\n  Key points: Illustrates how a broad set of camera brands (Nikon, Olympus, Pentax, Sony, Canon, Panasonic) is narrowed down., The consumer moves from awareness of 6 brands to considering 3 brands (Sony, Canon, Nikon)., The final purchase is a Canon camera., Loyalty is demonstrated by identifying with a specific high-end model, the Canon 5D MK4.\n- [diagram] An example application of the McKinsey purchasing funnel for buying a camera, nearly identical to the previous slide but without the illustrative icons and the specific final product model. The diagram structure shows ONLINE/OFFLINE channels and the five stages, illustrating the narrowing of camera brands considered by a consumer.\n\n- **AWARENESS:**\n  - ONLINE: Google, Facebook, 500px, ADS, Youtube, Blog, Website\n  - OFFLINE: Cinema, Billboard, Press, FNAC, Friends\n  - Brands considered: NIKON, OLYMPUS, PENTAX, SONY, CANON, PANASONIC\n\n- **FAMILIARITY:**\n  - ONLINE: SEO, Consumer opinion, Social media, Rankings, Mobile Marketing, Newsletter, Website, Blog, Youtube\n  - OFFLINE: Recommendations, Press, Radio, Billboard, Mailing, Catalog, Cinema, POS, Display\n  - Brands considered: PENTAX, SONY, CANON, NIKON, OLYMPUS\n\n- **CONSIDERATION:**\n  - ONLINE: e-Mailing, Consumer opinion, Website, Newsletter, Blog, Youtube\n  - OFFLINE: Recommendations, Press, TV, Offers, Location, Coupons, Word of Mouth, Catalog, Cinema\n  - Brands considered: SONY, CANON, NIKON\n\n- **PURCHASE:**\n  - ONLINE: POS, e-mail Confirmation, Checkout\n  - OFFLINE: Cash register ticket, Receipt\n  - Brand purchased: CANON\n\n- **LOYALTY:**\n  - ONLINE: Newsletter, Social media\n  - OFFLINE: Loyalty card, Mailing\n  Key points: Illustrates the narrowing of a brand consideration set for cameras, from 6 initial brands down to 1 purchased brand., The consumer journey progresses through awareness, familiarity, and consideration stages., The final purchase decision is for the 'CANON' brand., Unlike the previous slide, this version is more generic, lacking the specific icons and final product model (5D MK4).",
        "key_concepts": [
          "Generative AI (Gen AI)",
          "Customer Journey",
          "Personalized Advertising",
          "Augmented Reality",
          "Interactive Assistant",
          "Cost to Serve",
          "Customer Loyalty",
          "Cross-sell",
          "Up-sell",
          "McKinsey purchasing funnel",
          "Awareness",
          "Familiarity",
          "Consideration",
          "Purchase",
          "Loyalty"
        ],
        "educational_value": 0.9
      },
      {
        "topics": [
          "never stop daring",
          "le wagon first sessions"
        ],
        "content": "\n\n==================================================\n## Topic: Never Stop Daring\n(Source slides: 1)\n\n### Content\nAudencia\naudencia.com\n\nNEVER STOP DARING\n\n\"\nCultiver l'audace, toujours et à tout âge,\ncroire en soi, se lancer, innover,\napprendre de ses échecs,\nse relever et recommencer.\nS'engager avec et pour les autres,\nagir en manager responsable,\nrespectueux et bienveillant,\nimpacter positivement la société.\n\nL'audace nous grandit,\nélargit notre horizon,\nnourrit notre imagination\npour mieux transformer le monde.\n\"\n\n### Definitions\n- **L'audace (Audacity)**: According to the slide, audacity is a quality to be cultivated at all ages. It involves believing in oneself, launching initiatives, innovating, learning from failures, recovering and starting again. It also entails engaging with and for others, acting as a responsible, respectful, and caring manager, and positively impacting society. It is presented as a force for personal growth, broadening horizons, and fueling imagination to transform the world.\n\n### Key Concepts: Audacity (L'audace), Innovation, Resilience, Responsible Management, Societal Impact, Lifelong Learning, Branding\n\n==================================================\n## Topic: Le Wagon First Sessions\n(Source slides: 5)\n\n### Content\n• How it works\n• Make sure you received an e-mail explaining how to access the platform\n• Check the video on BlackBoard that explains how to approach these 2 online sessions\n• Before next off-line session (in 2 weeks), you MUST go through the following contents on LeWagon :\n  • Introduction\n  • Using Designer Tools\n  • Product Pitch\n  • UX Personas\n  • User Journeys\n  • User flow\n\n### Key Concepts: Le Wagon, BlackBoard, Online Sessions, Designer Tools, Product Pitch, UX Personas, User Journeys, User flow\n\n### Examples\n- The list of contents to complete on LeWagon: Introduction, Using Designer Tools, Product Pitch, UX Personas, User Journeys, User flow.\n\n### Visual Elements\n- [screenshot] A screenshot of the Le Wagon online learning platform interface is shown on the right side of the slide. It displays a course curriculum with sections like 'Product Design', 'Product Pitch', and 'UX Deep Dive'. Specific modules listed include 'WELCOME, WAGON', 'WIREFRAMING', 'BRANDING & UI', and 'UI KITS'. A red box highlights a video thumbnail titled 'Le Wagon Video Presentation'.\n  Key points: The screenshot provides a visual guide to the Le Wagon platform., It shows the structure of the course content students need to navigate., A specific video presentation is highlighted as an important resource.",
        "key_concepts": [
          "Audacity (L'audace)",
          "Innovation",
          "Resilience",
          "Responsible Management",
          "Societal Impact",
          "Lifelong Learning",
          "Branding",
          "Le Wagon",
          "BlackBoard",
          "Online Sessions",
          "Designer Tools",
          "Product Pitch",
          "UX Personas",
          "User Journeys",
          "User flow"
        ],
        "educational_value": 0.65
      }
    ],
    "consolidation_summary": "Consolidated into 6 topics: the customer journey, mckinsey purchasing funnel, the construction of personas, never stop daring, gen ai is reshaping customer journeys (+1 more). Contains 9 definitions, 58 examples, and 155 key concepts."
  }
}